Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xbe9 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x26648): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x95577): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x55f8): C:/Projekty/Battery_4_uI_R1/fw/STM32Cube_v2/MIBattController/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x11fe0): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x63872): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)

    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x6db1a): signed char
 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x3ed9b): __uint8_t
    <51>   DW_AT_decl_file   : 2
    <52>   DW_AT_decl_line   : 43
    <53>   DW_AT_decl_column : 24
    <54>   DW_AT_type        : <0x58>
 <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 8	(unsigned char)
    <5b>   DW_AT_name        : (indirect string, offset: 0xd459a): unsigned char
 <1><5f>: Abbrev Number: 3 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0xa30c0): short int
 <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
    <67>   DW_AT_byte_size   : 2
    <68>   DW_AT_encoding    : 7	(unsigned)
    <69>   DW_AT_name        : (indirect string, offset: 0xd2c06): short unsigned int
 <1><6d>: Abbrev Number: 4 (DW_TAG_typedef)
    <6e>   DW_AT_name        : (indirect string, offset: 0x86f35): __int32_t
    <72>   DW_AT_decl_file   : 2
    <73>   DW_AT_decl_line   : 77
    <74>   DW_AT_decl_column : 24
    <75>   DW_AT_type        : <0x79>
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0x12961): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x8bfb6): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x52c7a): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x2d40b): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x3ed9d): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 5 (DW_TAG_const_type)
    <a7>   DW_AT_type        : <0x9a>
 <1><ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x86f37): int32_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 44
    <b2>   DW_AT_decl_column : 19
    <b3>   DW_AT_type        : <0x6d>
 <1><b7>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <b8>   DW_AT_type        : <0xab>
 <1><bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x9f44a): uint32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 48
    <c3>   DW_AT_decl_column : 20
    <c4>   DW_AT_type        : <0x80>
 <1><c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 5 (DW_TAG_const_type)
    <ce>   DW_AT_type        : <0xbc>
 <1><d2>: Abbrev Number: 7 (DW_TAG_variable)
    <d3>   DW_AT_name        : (indirect string, offset: 0xa4d47): SystemCoreClock
    <d7>   DW_AT_decl_file   : 8
    <d8>   DW_AT_decl_line   : 53
    <d9>   DW_AT_decl_column : 19
    <da>   DW_AT_type        : <0xbc>
    <de>   DW_AT_external    : 1
    <de>   DW_AT_declaration : 1
 <1><de>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <df>   DW_AT_byte_size   : 4
 <1><e0>: Abbrev Number: 9 (DW_TAG_typedef)
    <e1>   DW_AT_name        : (indirect string, offset: 0xa13f9): wint_t
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 350
    <e8>   DW_AT_decl_column : 23
    <e9>   DW_AT_type        : <0x30>
 <1><ed>: Abbrev Number: 4 (DW_TAG_typedef)
    <ee>   DW_AT_name        : (indirect string, offset: 0xe2e1c): _off_t
    <f2>   DW_AT_decl_file   : 5
    <f3>   DW_AT_decl_line   : 46
    <f4>   DW_AT_decl_column : 14
    <f5>   DW_AT_type        : <0x79>
 <1><f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <fa>   DW_AT_name        : (indirect string, offset: 0x300e2): _fpos_t
    <fe>   DW_AT_decl_file   : 5
    <ff>   DW_AT_decl_line   : 116
    <100>   DW_AT_decl_column : 14
    <101>   DW_AT_type        : <0x79>
 <1><105>: Abbrev Number: 10 (DW_TAG_union_type)
    <106>   DW_AT_byte_size   : 4
    <107>   DW_AT_decl_file   : 5
    <108>   DW_AT_decl_line   : 165
    <109>   DW_AT_decl_column : 3
    <10a>   DW_AT_sibling     : <0x127>
 <2><10e>: Abbrev Number: 11 (DW_TAG_member)
    <10f>   DW_AT_name        : (indirect string, offset: 0xa8218): __wch
    <113>   DW_AT_decl_file   : 5
    <114>   DW_AT_decl_line   : 167
    <115>   DW_AT_decl_column : 12
    <116>   DW_AT_type        : <0xe0>
 <2><11a>: Abbrev Number: 11 (DW_TAG_member)
    <11b>   DW_AT_name        : (indirect string, offset: 0x70c02): __wchb
    <11f>   DW_AT_decl_file   : 5
    <120>   DW_AT_decl_line   : 168
    <121>   DW_AT_decl_column : 19
    <122>   DW_AT_type        : <0x127>
 <2><126>: Abbrev Number: 0
 <1><127>: Abbrev Number: 12 (DW_TAG_array_type)
    <128>   DW_AT_type        : <0x58>
    <12c>   DW_AT_sibling     : <0x137>
 <2><130>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <131>   DW_AT_type        : <0x30>
    <135>   DW_AT_upper_bound : 3
 <2><136>: Abbrev Number: 0
 <1><137>: Abbrev Number: 14 (DW_TAG_structure_type)
    <138>   DW_AT_byte_size   : 8
    <139>   DW_AT_decl_file   : 5
    <13a>   DW_AT_decl_line   : 162
    <13b>   DW_AT_decl_column : 9
    <13c>   DW_AT_sibling     : <0x15b>
 <2><140>: Abbrev Number: 15 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x3cdae): __count
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 164
    <147>   DW_AT_decl_column : 7
    <148>   DW_AT_type        : <0x29>
    <14c>   DW_AT_data_member_location: 0
 <2><14d>: Abbrev Number: 15 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x2c6c0): __value
    <152>   DW_AT_decl_file   : 5
    <153>   DW_AT_decl_line   : 169
    <154>   DW_AT_decl_column : 5
    <155>   DW_AT_type        : <0x105>
    <159>   DW_AT_data_member_location: 4
 <2><15a>: Abbrev Number: 0
 <1><15b>: Abbrev Number: 4 (DW_TAG_typedef)
    <15c>   DW_AT_name        : (indirect string, offset: 0x9fcb4): _mbstate_t
    <160>   DW_AT_decl_file   : 5
    <161>   DW_AT_decl_line   : 170
    <162>   DW_AT_decl_column : 3
    <163>   DW_AT_type        : <0x137>
 <1><167>: Abbrev Number: 4 (DW_TAG_typedef)
    <168>   DW_AT_name        : (indirect string, offset: 0xc4671): __ULong
    <16c>   DW_AT_decl_file   : 6
    <16d>   DW_AT_decl_line   : 22
    <16e>   DW_AT_decl_column : 25
    <16f>   DW_AT_type        : <0x8c>
 <1><173>: Abbrev Number: 4 (DW_TAG_typedef)
    <174>   DW_AT_name        : (indirect string, offset: 0x77a6e): _LOCK_T
    <178>   DW_AT_decl_file   : 7
    <179>   DW_AT_decl_line   : 34
    <17a>   DW_AT_decl_column : 25
    <17b>   DW_AT_type        : <0x17f>
 <1><17f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <180>   DW_AT_byte_size   : 4
    <181>   DW_AT_type        : <0x185>
 <1><185>: Abbrev Number: 17 (DW_TAG_structure_type)
    <186>   DW_AT_name        : (indirect string, offset: 0x1b6f9): __lock
    <18a>   DW_AT_declaration : 1
 <1><18a>: Abbrev Number: 4 (DW_TAG_typedef)
    <18b>   DW_AT_name        : (indirect string, offset: 0x6c1ce): _flock_t
    <18f>   DW_AT_decl_file   : 6
    <190>   DW_AT_decl_line   : 35
    <191>   DW_AT_decl_column : 27
    <192>   DW_AT_type        : <0x173>
 <1><196>: Abbrev Number: 18 (DW_TAG_structure_type)
    <197>   DW_AT_name        : (indirect string, offset: 0x472d6): _Bigint
    <19b>   DW_AT_byte_size   : 24
    <19c>   DW_AT_decl_file   : 6
    <19d>   DW_AT_decl_line   : 52
    <19e>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1f0>
 <2><1a3>: Abbrev Number: 15 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x82223): _next
    <1a8>   DW_AT_decl_file   : 6
    <1a9>   DW_AT_decl_line   : 54
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1f0>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 19 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 6
    <1b5>   DW_AT_decl_line   : 55
    <1b6>   DW_AT_decl_column : 7
    <1b7>   DW_AT_type        : <0x29>
    <1bb>   DW_AT_data_member_location: 4
 <2><1bc>: Abbrev Number: 15 (DW_TAG_member)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x9cfcd): _maxwds
    <1c1>   DW_AT_decl_file   : 6
    <1c2>   DW_AT_decl_line   : 55
    <1c3>   DW_AT_decl_column : 11
    <1c4>   DW_AT_type        : <0x29>
    <1c8>   DW_AT_data_member_location: 8
 <2><1c9>: Abbrev Number: 15 (DW_TAG_member)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x74739): _sign
    <1ce>   DW_AT_decl_file   : 6
    <1cf>   DW_AT_decl_line   : 55
    <1d0>   DW_AT_decl_column : 20
    <1d1>   DW_AT_type        : <0x29>
    <1d5>   DW_AT_data_member_location: 12
 <2><1d6>: Abbrev Number: 15 (DW_TAG_member)
    <1d7>   DW_AT_name        : (indirect string, offset: 0x743ef): _wds
    <1db>   DW_AT_decl_file   : 6
    <1dc>   DW_AT_decl_line   : 55
    <1dd>   DW_AT_decl_column : 27
    <1de>   DW_AT_type        : <0x29>
    <1e2>   DW_AT_data_member_location: 16
 <2><1e3>: Abbrev Number: 19 (DW_TAG_member)
    <1e4>   DW_AT_name        : _x
    <1e7>   DW_AT_decl_file   : 6
    <1e8>   DW_AT_decl_line   : 56
    <1e9>   DW_AT_decl_column : 11
    <1ea>   DW_AT_type        : <0x1f6>
    <1ee>   DW_AT_data_member_location: 20
 <2><1ef>: Abbrev Number: 0
 <1><1f0>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1f1>   DW_AT_byte_size   : 4
    <1f2>   DW_AT_type        : <0x196>
 <1><1f6>: Abbrev Number: 12 (DW_TAG_array_type)
    <1f7>   DW_AT_type        : <0x167>
    <1fb>   DW_AT_sibling     : <0x206>
 <2><1ff>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <200>   DW_AT_type        : <0x30>
    <204>   DW_AT_upper_bound : 0
 <2><205>: Abbrev Number: 0
 <1><206>: Abbrev Number: 18 (DW_TAG_structure_type)
    <207>   DW_AT_name        : (indirect string, offset: 0x3b0fe): __tm
    <20b>   DW_AT_byte_size   : 36
    <20c>   DW_AT_decl_file   : 6
    <20d>   DW_AT_decl_line   : 60
    <20e>   DW_AT_decl_column : 8
    <20f>   DW_AT_sibling     : <0x289>
 <2><213>: Abbrev Number: 15 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0xb41f6): __tm_sec
    <218>   DW_AT_decl_file   : 6
    <219>   DW_AT_decl_line   : 62
    <21a>   DW_AT_decl_column : 9
    <21b>   DW_AT_type        : <0x29>
    <21f>   DW_AT_data_member_location: 0
 <2><220>: Abbrev Number: 15 (DW_TAG_member)
    <221>   DW_AT_name        : (indirect string, offset: 0x1155): __tm_min
    <225>   DW_AT_decl_file   : 6
    <226>   DW_AT_decl_line   : 63
    <227>   DW_AT_decl_column : 9
    <228>   DW_AT_type        : <0x29>
    <22c>   DW_AT_data_member_location: 4
 <2><22d>: Abbrev Number: 15 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x2e2dc): __tm_hour
    <232>   DW_AT_decl_file   : 6
    <233>   DW_AT_decl_line   : 64
    <234>   DW_AT_decl_column : 9
    <235>   DW_AT_type        : <0x29>
    <239>   DW_AT_data_member_location: 8
 <2><23a>: Abbrev Number: 15 (DW_TAG_member)
    <23b>   DW_AT_name        : (indirect string, offset: 0x800f3): __tm_mday
    <23f>   DW_AT_decl_file   : 6
    <240>   DW_AT_decl_line   : 65
    <241>   DW_AT_decl_column : 9
    <242>   DW_AT_type        : <0x29>
    <246>   DW_AT_data_member_location: 12
 <2><247>: Abbrev Number: 15 (DW_TAG_member)
    <248>   DW_AT_name        : (indirect string, offset: 0x3e67): __tm_mon
    <24c>   DW_AT_decl_file   : 6
    <24d>   DW_AT_decl_line   : 66
    <24e>   DW_AT_decl_column : 9
    <24f>   DW_AT_type        : <0x29>
    <253>   DW_AT_data_member_location: 16
 <2><254>: Abbrev Number: 15 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x8312c): __tm_year
    <259>   DW_AT_decl_file   : 6
    <25a>   DW_AT_decl_line   : 67
    <25b>   DW_AT_decl_column : 9
    <25c>   DW_AT_type        : <0x29>
    <260>   DW_AT_data_member_location: 20
 <2><261>: Abbrev Number: 15 (DW_TAG_member)
    <262>   DW_AT_name        : (indirect string, offset: 0x5bd45): __tm_wday
    <266>   DW_AT_decl_file   : 6
    <267>   DW_AT_decl_line   : 68
    <268>   DW_AT_decl_column : 9
    <269>   DW_AT_type        : <0x29>
    <26d>   DW_AT_data_member_location: 24
 <2><26e>: Abbrev Number: 15 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x54a1a): __tm_yday
    <273>   DW_AT_decl_file   : 6
    <274>   DW_AT_decl_line   : 69
    <275>   DW_AT_decl_column : 9
    <276>   DW_AT_type        : <0x29>
    <27a>   DW_AT_data_member_location: 28
 <2><27b>: Abbrev Number: 15 (DW_TAG_member)
    <27c>   DW_AT_name        : (indirect string, offset: 0xc5c6c): __tm_isdst
    <280>   DW_AT_decl_file   : 6
    <281>   DW_AT_decl_line   : 70
    <282>   DW_AT_decl_column : 9
    <283>   DW_AT_type        : <0x29>
    <287>   DW_AT_data_member_location: 32
 <2><288>: Abbrev Number: 0
 <1><289>: Abbrev Number: 20 (DW_TAG_structure_type)
    <28a>   DW_AT_name        : (indirect string, offset: 0x68a0c): _on_exit_args
    <28e>   DW_AT_byte_size   : 264
    <290>   DW_AT_decl_file   : 6
    <291>   DW_AT_decl_line   : 79
    <292>   DW_AT_decl_column : 8
    <293>   DW_AT_sibling     : <0x2ce>
 <2><297>: Abbrev Number: 15 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xc3970): _fnargs
    <29c>   DW_AT_decl_file   : 6
    <29d>   DW_AT_decl_line   : 80
    <29e>   DW_AT_decl_column : 10
    <29f>   DW_AT_type        : <0x2ce>
    <2a3>   DW_AT_data_member_location: 0
 <2><2a4>: Abbrev Number: 15 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xb7b92): _dso_handle
    <2a9>   DW_AT_decl_file   : 6
    <2aa>   DW_AT_decl_line   : 81
    <2ab>   DW_AT_decl_column : 9
    <2ac>   DW_AT_type        : <0x2ce>
    <2b0>   DW_AT_data_member_location: 128
 <2><2b1>: Abbrev Number: 21 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x99781): _fntypes
    <2b6>   DW_AT_decl_file   : 6
    <2b7>   DW_AT_decl_line   : 83
    <2b8>   DW_AT_decl_column : 10
    <2b9>   DW_AT_type        : <0x167>
    <2bd>   DW_AT_data_member_location: 256
 <2><2bf>: Abbrev Number: 21 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x59432): _is_cxa
    <2c4>   DW_AT_decl_file   : 6
    <2c5>   DW_AT_decl_line   : 86
    <2c6>   DW_AT_decl_column : 10
    <2c7>   DW_AT_type        : <0x167>
    <2cb>   DW_AT_data_member_location: 260
 <2><2cd>: Abbrev Number: 0
 <1><2ce>: Abbrev Number: 12 (DW_TAG_array_type)
    <2cf>   DW_AT_type        : <0xde>
    <2d3>   DW_AT_sibling     : <0x2de>
 <2><2d7>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <2d8>   DW_AT_type        : <0x30>
    <2dc>   DW_AT_upper_bound : 31
 <2><2dd>: Abbrev Number: 0
 <1><2de>: Abbrev Number: 18 (DW_TAG_structure_type)
    <2df>   DW_AT_name        : (indirect string, offset: 0x428c): _atexit
    <2e3>   DW_AT_byte_size   : 140
    <2e4>   DW_AT_decl_file   : 6
    <2e5>   DW_AT_decl_line   : 90
    <2e6>   DW_AT_decl_column : 8
    <2e7>   DW_AT_sibling     : <0x320>
 <2><2eb>: Abbrev Number: 15 (DW_TAG_member)
    <2ec>   DW_AT_name        : (indirect string, offset: 0x82223): _next
    <2f0>   DW_AT_decl_file   : 6
    <2f1>   DW_AT_decl_line   : 91
    <2f2>   DW_AT_decl_column : 18
    <2f3>   DW_AT_type        : <0x320>
    <2f7>   DW_AT_data_member_location: 0
 <2><2f8>: Abbrev Number: 15 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x8b128): _ind
    <2fd>   DW_AT_decl_file   : 6
    <2fe>   DW_AT_decl_line   : 92
    <2ff>   DW_AT_decl_column : 6
    <300>   DW_AT_type        : <0x29>
    <304>   DW_AT_data_member_location: 4
 <2><305>: Abbrev Number: 15 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0x2fd7b): _fns
    <30a>   DW_AT_decl_file   : 6
    <30b>   DW_AT_decl_line   : 93
    <30c>   DW_AT_decl_column : 9
    <30d>   DW_AT_type        : <0x326>
    <311>   DW_AT_data_member_location: 8
 <2><312>: Abbrev Number: 15 (DW_TAG_member)
    <313>   DW_AT_name        : (indirect string, offset: 0xb0f14): _on_exit_args_ptr
    <317>   DW_AT_decl_file   : 6
    <318>   DW_AT_decl_line   : 94
    <319>   DW_AT_decl_column : 32
    <31a>   DW_AT_type        : <0x33d>
    <31e>   DW_AT_data_member_location: 136
 <2><31f>: Abbrev Number: 0
 <1><320>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <321>   DW_AT_byte_size   : 4
    <322>   DW_AT_type        : <0x2de>
 <1><326>: Abbrev Number: 12 (DW_TAG_array_type)
    <327>   DW_AT_type        : <0x336>
    <32b>   DW_AT_sibling     : <0x336>
 <2><32f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <330>   DW_AT_type        : <0x30>
    <334>   DW_AT_upper_bound : 31
 <2><335>: Abbrev Number: 0
 <1><336>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <337>   DW_AT_byte_size   : 4
    <338>   DW_AT_type        : <0x33c>
 <1><33c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <33d>   DW_AT_prototyped  : 1
 <1><33d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <33e>   DW_AT_byte_size   : 4
    <33f>   DW_AT_type        : <0x289>
 <1><343>: Abbrev Number: 18 (DW_TAG_structure_type)
    <344>   DW_AT_name        : (indirect string, offset: 0x92eee): __sbuf
    <348>   DW_AT_byte_size   : 8
    <349>   DW_AT_decl_file   : 6
    <34a>   DW_AT_decl_line   : 122
    <34b>   DW_AT_decl_column : 8
    <34c>   DW_AT_sibling     : <0x36b>
 <2><350>: Abbrev Number: 15 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x47f08): _base
    <355>   DW_AT_decl_file   : 6
    <356>   DW_AT_decl_line   : 123
    <357>   DW_AT_decl_column : 17
    <358>   DW_AT_type        : <0x36b>
    <35c>   DW_AT_data_member_location: 0
 <2><35d>: Abbrev Number: 15 (DW_TAG_member)
    <35e>   DW_AT_name        : (indirect string, offset: 0xe1c83): _size
    <362>   DW_AT_decl_file   : 6
    <363>   DW_AT_decl_line   : 124
    <364>   DW_AT_decl_column : 6
    <365>   DW_AT_type        : <0x29>
    <369>   DW_AT_data_member_location: 4
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <36c>   DW_AT_byte_size   : 4
    <36d>   DW_AT_type        : <0x58>
 <1><371>: Abbrev Number: 18 (DW_TAG_structure_type)
    <372>   DW_AT_name        : (indirect string, offset: 0x2899c): __sFILE_fake
    <376>   DW_AT_byte_size   : 32
    <377>   DW_AT_decl_file   : 6
    <378>   DW_AT_decl_line   : 158
    <379>   DW_AT_decl_column : 8
    <37a>   DW_AT_sibling     : <0x3e4>
 <2><37e>: Abbrev Number: 19 (DW_TAG_member)
    <37f>   DW_AT_name        : _p
    <382>   DW_AT_decl_file   : 6
    <383>   DW_AT_decl_line   : 159
    <384>   DW_AT_decl_column : 18
    <385>   DW_AT_type        : <0x36b>
    <389>   DW_AT_data_member_location: 0
 <2><38a>: Abbrev Number: 19 (DW_TAG_member)
    <38b>   DW_AT_name        : _r
    <38e>   DW_AT_decl_file   : 6
    <38f>   DW_AT_decl_line   : 160
    <390>   DW_AT_decl_column : 7
    <391>   DW_AT_type        : <0x29>
    <395>   DW_AT_data_member_location: 4
 <2><396>: Abbrev Number: 19 (DW_TAG_member)
    <397>   DW_AT_name        : _w
    <39a>   DW_AT_decl_file   : 6
    <39b>   DW_AT_decl_line   : 161
    <39c>   DW_AT_decl_column : 7
    <39d>   DW_AT_type        : <0x29>
    <3a1>   DW_AT_data_member_location: 8
 <2><3a2>: Abbrev Number: 15 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x63916): _flags
    <3a7>   DW_AT_decl_file   : 6
    <3a8>   DW_AT_decl_line   : 162
    <3a9>   DW_AT_decl_column : 9
    <3aa>   DW_AT_type        : <0x5f>
    <3ae>   DW_AT_data_member_location: 12
 <2><3af>: Abbrev Number: 15 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x8a800): _file
    <3b4>   DW_AT_decl_file   : 6
    <3b5>   DW_AT_decl_line   : 163
    <3b6>   DW_AT_decl_column : 9
    <3b7>   DW_AT_type        : <0x5f>
    <3bb>   DW_AT_data_member_location: 14
 <2><3bc>: Abbrev Number: 19 (DW_TAG_member)
    <3bd>   DW_AT_name        : _bf
    <3c1>   DW_AT_decl_file   : 6
    <3c2>   DW_AT_decl_line   : 164
    <3c3>   DW_AT_decl_column : 17
    <3c4>   DW_AT_type        : <0x343>
    <3c8>   DW_AT_data_member_location: 16
 <2><3c9>: Abbrev Number: 15 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x63f7b): _lbfsize
    <3ce>   DW_AT_decl_file   : 6
    <3cf>   DW_AT_decl_line   : 165
    <3d0>   DW_AT_decl_column : 7
    <3d1>   DW_AT_type        : <0x29>
    <3d5>   DW_AT_data_member_location: 24
 <2><3d6>: Abbrev Number: 15 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xe803c): _data
    <3db>   DW_AT_decl_file   : 6
    <3dc>   DW_AT_decl_line   : 167
    <3dd>   DW_AT_decl_column : 18
    <3de>   DW_AT_type        : <0x52c>
    <3e2>   DW_AT_data_member_location: 28
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 5 (DW_TAG_const_type)
    <3e5>   DW_AT_type        : <0x371>
 <1><3e9>: Abbrev Number: 23 (DW_TAG_structure_type)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xeca9b): _reent
    <3ee>   DW_AT_byte_size   : 96
    <3ef>   DW_AT_decl_file   : 6
    <3f0>   DW_AT_decl_line   : 377
    <3f2>   DW_AT_decl_column : 8
    <3f3>   DW_AT_sibling     : <0x52c>
 <2><3f7>: Abbrev Number: 24 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x8032b): _errno
    <3fc>   DW_AT_decl_file   : 6
    <3fd>   DW_AT_decl_line   : 381
    <3ff>   DW_AT_decl_column : 7
    <400>   DW_AT_type        : <0x29>
    <404>   DW_AT_data_member_location: 0
 <2><405>: Abbrev Number: 24 (DW_TAG_member)
    <406>   DW_AT_name        : (indirect string, offset: 0x68661): _stdin
    <40a>   DW_AT_decl_file   : 6
    <40b>   DW_AT_decl_line   : 386
    <40d>   DW_AT_decl_column : 11
    <40e>   DW_AT_type        : <0x784>
    <412>   DW_AT_data_member_location: 4
 <2><413>: Abbrev Number: 24 (DW_TAG_member)
    <414>   DW_AT_name        : (indirect string, offset: 0xdb146): _stdout
    <418>   DW_AT_decl_file   : 6
    <419>   DW_AT_decl_line   : 386
    <41b>   DW_AT_decl_column : 20
    <41c>   DW_AT_type        : <0x784>
    <420>   DW_AT_data_member_location: 8
 <2><421>: Abbrev Number: 24 (DW_TAG_member)
    <422>   DW_AT_name        : (indirect string, offset: 0xda191): _stderr
    <426>   DW_AT_decl_file   : 6
    <427>   DW_AT_decl_line   : 386
    <429>   DW_AT_decl_column : 30
    <42a>   DW_AT_type        : <0x784>
    <42e>   DW_AT_data_member_location: 12
 <2><42f>: Abbrev Number: 24 (DW_TAG_member)
    <430>   DW_AT_name        : (indirect string, offset: 0x8b123): _inc
    <434>   DW_AT_decl_file   : 6
    <435>   DW_AT_decl_line   : 388
    <437>   DW_AT_decl_column : 8
    <438>   DW_AT_type        : <0x29>
    <43c>   DW_AT_data_member_location: 16
 <2><43d>: Abbrev Number: 24 (DW_TAG_member)
    <43e>   DW_AT_name        : (indirect string, offset: 0xad51d): _emergency
    <442>   DW_AT_decl_file   : 6
    <443>   DW_AT_decl_line   : 390
    <445>   DW_AT_decl_column : 9
    <446>   DW_AT_type        : <0x698>
    <44a>   DW_AT_data_member_location: 20
 <2><44b>: Abbrev Number: 24 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x5e2d6): __sdidinit
    <450>   DW_AT_decl_file   : 6
    <451>   DW_AT_decl_line   : 392
    <453>   DW_AT_decl_column : 7
    <454>   DW_AT_type        : <0x29>
    <458>   DW_AT_data_member_location: 24
 <2><459>: Abbrev Number: 24 (DW_TAG_member)
    <45a>   DW_AT_name        : (indirect string, offset: 0x138f2): _unspecified_locale_info
    <45e>   DW_AT_decl_file   : 6
    <45f>   DW_AT_decl_line   : 394
    <461>   DW_AT_decl_column : 7
    <462>   DW_AT_type        : <0x29>
    <466>   DW_AT_data_member_location: 28
 <2><467>: Abbrev Number: 24 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0xc2e71): _locale
    <46c>   DW_AT_decl_file   : 6
    <46d>   DW_AT_decl_line   : 395
    <46f>   DW_AT_decl_column : 22
    <470>   DW_AT_type        : <0x8ec>
    <474>   DW_AT_data_member_location: 32
 <2><475>: Abbrev Number: 25 (DW_TAG_member)
    <476>   DW_AT_name        : _mp
    <47a>   DW_AT_decl_file   : 6
    <47b>   DW_AT_decl_line   : 397
    <47d>   DW_AT_decl_column : 18
    <47e>   DW_AT_type        : <0x8f2>
    <482>   DW_AT_data_member_location: 36
 <2><483>: Abbrev Number: 24 (DW_TAG_member)
    <484>   DW_AT_name        : (indirect string, offset: 0x21bf6): __cleanup
    <488>   DW_AT_decl_file   : 6
    <489>   DW_AT_decl_line   : 399
    <48b>   DW_AT_decl_column : 10
    <48c>   DW_AT_type        : <0x903>
    <490>   DW_AT_data_member_location: 40
 <2><491>: Abbrev Number: 24 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x875d2): _gamma_signgam
    <496>   DW_AT_decl_file   : 6
    <497>   DW_AT_decl_line   : 401
    <499>   DW_AT_decl_column : 7
    <49a>   DW_AT_type        : <0x29>
    <49e>   DW_AT_data_member_location: 44
 <2><49f>: Abbrev Number: 24 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xb0387): _cvtlen
    <4a4>   DW_AT_decl_file   : 6
    <4a5>   DW_AT_decl_line   : 404
    <4a7>   DW_AT_decl_column : 7
    <4a8>   DW_AT_type        : <0x29>
    <4ac>   DW_AT_data_member_location: 48
 <2><4ad>: Abbrev Number: 24 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x64d0a): _cvtbuf
    <4b2>   DW_AT_decl_file   : 6
    <4b3>   DW_AT_decl_line   : 405
    <4b5>   DW_AT_decl_column : 9
    <4b6>   DW_AT_type        : <0x698>
    <4ba>   DW_AT_data_member_location: 52
 <2><4bb>: Abbrev Number: 24 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0xa3932): _r48
    <4c0>   DW_AT_decl_file   : 6
    <4c1>   DW_AT_decl_line   : 407
    <4c3>   DW_AT_decl_column : 19
    <4c4>   DW_AT_type        : <0x909>
    <4c8>   DW_AT_data_member_location: 56
 <2><4c9>: Abbrev Number: 24 (DW_TAG_member)
    <4ca>   DW_AT_name        : (indirect string, offset: 0xb6c24): _localtime_buf
    <4ce>   DW_AT_decl_file   : 6
    <4cf>   DW_AT_decl_line   : 408
    <4d1>   DW_AT_decl_column : 16
    <4d2>   DW_AT_type        : <0x90f>
    <4d6>   DW_AT_data_member_location: 60
 <2><4d7>: Abbrev Number: 24 (DW_TAG_member)
    <4d8>   DW_AT_name        : (indirect string, offset: 0x30310): _asctime_buf
    <4dc>   DW_AT_decl_file   : 6
    <4dd>   DW_AT_decl_line   : 409
    <4df>   DW_AT_decl_column : 9
    <4e0>   DW_AT_type        : <0x698>
    <4e4>   DW_AT_data_member_location: 64
 <2><4e5>: Abbrev Number: 24 (DW_TAG_member)
    <4e6>   DW_AT_name        : (indirect string, offset: 0xb4752): _sig_func
    <4ea>   DW_AT_decl_file   : 6
    <4eb>   DW_AT_decl_line   : 412
    <4ed>   DW_AT_decl_column : 12
    <4ee>   DW_AT_type        : <0x920>
    <4f2>   DW_AT_data_member_location: 68
 <2><4f3>: Abbrev Number: 24 (DW_TAG_member)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x9ce78): __sglue
    <4f8>   DW_AT_decl_file   : 6
    <4f9>   DW_AT_decl_line   : 420
    <4fb>   DW_AT_decl_column : 16
    <4fc>   DW_AT_type        : <0x745>
    <500>   DW_AT_data_member_location: 72
 <2><501>: Abbrev Number: 24 (DW_TAG_member)
    <502>   DW_AT_name        : (indirect string, offset: 0x3a987): __sf
    <506>   DW_AT_decl_file   : 6
    <507>   DW_AT_decl_line   : 421
    <509>   DW_AT_decl_column : 11
    <50a>   DW_AT_type        : <0x784>
    <50e>   DW_AT_data_member_location: 84
 <2><50f>: Abbrev Number: 24 (DW_TAG_member)
    <510>   DW_AT_name        : (indirect string, offset: 0x62bba): _misc
    <514>   DW_AT_decl_file   : 6
    <515>   DW_AT_decl_line   : 422
    <517>   DW_AT_decl_column : 23
    <518>   DW_AT_type        : <0x92c>
    <51c>   DW_AT_data_member_location: 88
 <2><51d>: Abbrev Number: 24 (DW_TAG_member)
    <51e>   DW_AT_name        : (indirect string, offset: 0x88d54): _signal_buf
    <522>   DW_AT_decl_file   : 6
    <523>   DW_AT_decl_line   : 423
    <525>   DW_AT_decl_column : 9
    <526>   DW_AT_type        : <0x698>
    <52a>   DW_AT_data_member_location: 92
 <2><52b>: Abbrev Number: 0
 <1><52c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <52d>   DW_AT_byte_size   : 4
    <52e>   DW_AT_type        : <0x3e9>
 <1><532>: Abbrev Number: 5 (DW_TAG_const_type)
    <533>   DW_AT_type        : <0x52c>
 <1><537>: Abbrev Number: 18 (DW_TAG_structure_type)
    <538>   DW_AT_name        : (indirect string, offset: 0xa7d81): __sFILE
    <53c>   DW_AT_byte_size   : 104
    <53d>   DW_AT_decl_file   : 6
    <53e>   DW_AT_decl_line   : 186
    <53f>   DW_AT_decl_column : 8
    <540>   DW_AT_sibling     : <0x67a>
 <2><544>: Abbrev Number: 19 (DW_TAG_member)
    <545>   DW_AT_name        : _p
    <548>   DW_AT_decl_file   : 6
    <549>   DW_AT_decl_line   : 187
    <54a>   DW_AT_decl_column : 18
    <54b>   DW_AT_type        : <0x36b>
    <54f>   DW_AT_data_member_location: 0
 <2><550>: Abbrev Number: 19 (DW_TAG_member)
    <551>   DW_AT_name        : _r
    <554>   DW_AT_decl_file   : 6
    <555>   DW_AT_decl_line   : 188
    <556>   DW_AT_decl_column : 7
    <557>   DW_AT_type        : <0x29>
    <55b>   DW_AT_data_member_location: 4
 <2><55c>: Abbrev Number: 19 (DW_TAG_member)
    <55d>   DW_AT_name        : _w
    <560>   DW_AT_decl_file   : 6
    <561>   DW_AT_decl_line   : 189
    <562>   DW_AT_decl_column : 7
    <563>   DW_AT_type        : <0x29>
    <567>   DW_AT_data_member_location: 8
 <2><568>: Abbrev Number: 15 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x63916): _flags
    <56d>   DW_AT_decl_file   : 6
    <56e>   DW_AT_decl_line   : 190
    <56f>   DW_AT_decl_column : 9
    <570>   DW_AT_type        : <0x5f>
    <574>   DW_AT_data_member_location: 12
 <2><575>: Abbrev Number: 15 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0x8a800): _file
    <57a>   DW_AT_decl_file   : 6
    <57b>   DW_AT_decl_line   : 191
    <57c>   DW_AT_decl_column : 9
    <57d>   DW_AT_type        : <0x5f>
    <581>   DW_AT_data_member_location: 14
 <2><582>: Abbrev Number: 19 (DW_TAG_member)
    <583>   DW_AT_name        : _bf
    <587>   DW_AT_decl_file   : 6
    <588>   DW_AT_decl_line   : 192
    <589>   DW_AT_decl_column : 17
    <58a>   DW_AT_type        : <0x343>
    <58e>   DW_AT_data_member_location: 16
 <2><58f>: Abbrev Number: 15 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0x63f7b): _lbfsize
    <594>   DW_AT_decl_file   : 6
    <595>   DW_AT_decl_line   : 193
    <596>   DW_AT_decl_column : 7
    <597>   DW_AT_type        : <0x29>
    <59b>   DW_AT_data_member_location: 24
 <2><59c>: Abbrev Number: 15 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0xe803c): _data
    <5a1>   DW_AT_decl_file   : 6
    <5a2>   DW_AT_decl_line   : 196
    <5a3>   DW_AT_decl_column : 18
    <5a4>   DW_AT_type        : <0x52c>
    <5a8>   DW_AT_data_member_location: 28
 <2><5a9>: Abbrev Number: 15 (DW_TAG_member)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xc4038): _cookie
    <5ae>   DW_AT_decl_file   : 6
    <5af>   DW_AT_decl_line   : 200
    <5b0>   DW_AT_decl_column : 10
    <5b1>   DW_AT_type        : <0xde>
    <5b5>   DW_AT_data_member_location: 32
 <2><5b6>: Abbrev Number: 15 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0xad154): _read
    <5bb>   DW_AT_decl_file   : 6
    <5bc>   DW_AT_decl_line   : 202
    <5bd>   DW_AT_decl_column : 29
    <5be>   DW_AT_type        : <0x6aa>
    <5c2>   DW_AT_data_member_location: 36
 <2><5c3>: Abbrev Number: 15 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x2eb54): _write
    <5c8>   DW_AT_decl_file   : 6
    <5c9>   DW_AT_decl_line   : 204
    <5ca>   DW_AT_decl_column : 29
    <5cb>   DW_AT_type        : <0x6d4>
    <5cf>   DW_AT_data_member_location: 40
 <2><5d0>: Abbrev Number: 15 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x3f0f8): _seek
    <5d5>   DW_AT_decl_file   : 6
    <5d6>   DW_AT_decl_line   : 207
    <5d7>   DW_AT_decl_column : 13
    <5d8>   DW_AT_type        : <0x6f8>
    <5dc>   DW_AT_data_member_location: 44
 <2><5dd>: Abbrev Number: 15 (DW_TAG_member)
    <5de>   DW_AT_name        : (indirect string, offset: 0x5f8fa): _close
    <5e2>   DW_AT_decl_file   : 6
    <5e3>   DW_AT_decl_line   : 208
    <5e4>   DW_AT_decl_column : 9
    <5e5>   DW_AT_type        : <0x712>
    <5e9>   DW_AT_data_member_location: 48
 <2><5ea>: Abbrev Number: 19 (DW_TAG_member)
    <5eb>   DW_AT_name        : _ub
    <5ef>   DW_AT_decl_file   : 6
    <5f0>   DW_AT_decl_line   : 211
    <5f1>   DW_AT_decl_column : 17
    <5f2>   DW_AT_type        : <0x343>
    <5f6>   DW_AT_data_member_location: 52
 <2><5f7>: Abbrev Number: 19 (DW_TAG_member)
    <5f8>   DW_AT_name        : _up
    <5fc>   DW_AT_decl_file   : 6
    <5fd>   DW_AT_decl_line   : 212
    <5fe>   DW_AT_decl_column : 18
    <5ff>   DW_AT_type        : <0x36b>
    <603>   DW_AT_data_member_location: 60
 <2><604>: Abbrev Number: 19 (DW_TAG_member)
    <605>   DW_AT_name        : _ur
    <609>   DW_AT_decl_file   : 6
    <60a>   DW_AT_decl_line   : 213
    <60b>   DW_AT_decl_column : 7
    <60c>   DW_AT_type        : <0x29>
    <610>   DW_AT_data_member_location: 64
 <2><611>: Abbrev Number: 15 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0xd59a1): _ubuf
    <616>   DW_AT_decl_file   : 6
    <617>   DW_AT_decl_line   : 216
    <618>   DW_AT_decl_column : 17
    <619>   DW_AT_type        : <0x718>
    <61d>   DW_AT_data_member_location: 68
 <2><61e>: Abbrev Number: 15 (DW_TAG_member)
    <61f>   DW_AT_name        : (indirect string, offset: 0x9589b): _nbuf
    <623>   DW_AT_decl_file   : 6
    <624>   DW_AT_decl_line   : 217
    <625>   DW_AT_decl_column : 17
    <626>   DW_AT_type        : <0x728>
    <62a>   DW_AT_data_member_location: 71
 <2><62b>: Abbrev Number: 19 (DW_TAG_member)
    <62c>   DW_AT_name        : _lb
    <630>   DW_AT_decl_file   : 6
    <631>   DW_AT_decl_line   : 220
    <632>   DW_AT_decl_column : 17
    <633>   DW_AT_type        : <0x343>
    <637>   DW_AT_data_member_location: 72
 <2><638>: Abbrev Number: 15 (DW_TAG_member)
    <639>   DW_AT_name        : (indirect string, offset: 0xe262e): _blksize
    <63d>   DW_AT_decl_file   : 6
    <63e>   DW_AT_decl_line   : 223
    <63f>   DW_AT_decl_column : 7
    <640>   DW_AT_type        : <0x29>
    <644>   DW_AT_data_member_location: 80
 <2><645>: Abbrev Number: 15 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x45720): _offset
    <64a>   DW_AT_decl_file   : 6
    <64b>   DW_AT_decl_line   : 224
    <64c>   DW_AT_decl_column : 10
    <64d>   DW_AT_type        : <0xed>
    <651>   DW_AT_data_member_location: 84
 <2><652>: Abbrev Number: 15 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x1b6fa): _lock
    <657>   DW_AT_decl_file   : 6
    <658>   DW_AT_decl_line   : 231
    <659>   DW_AT_decl_column : 12
    <65a>   DW_AT_type        : <0x18a>
    <65e>   DW_AT_data_member_location: 88
 <2><65f>: Abbrev Number: 15 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x19462): _mbstate
    <664>   DW_AT_decl_file   : 6
    <665>   DW_AT_decl_line   : 233
    <666>   DW_AT_decl_column : 14
    <667>   DW_AT_type        : <0x15b>
    <66b>   DW_AT_data_member_location: 92
 <2><66c>: Abbrev Number: 15 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0xc97e7): _flags2
    <671>   DW_AT_decl_file   : 6
    <672>   DW_AT_decl_line   : 234
    <673>   DW_AT_decl_column : 9
    <674>   DW_AT_type        : <0x29>
    <678>   DW_AT_data_member_location: 100
 <2><679>: Abbrev Number: 0
 <1><67a>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <67b>   DW_AT_prototyped  : 1
    <67b>   DW_AT_type        : <0x29>
    <67f>   DW_AT_sibling     : <0x698>
 <2><683>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <684>   DW_AT_type        : <0x52c>
 <2><688>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <689>   DW_AT_type        : <0xde>
 <2><68d>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <68e>   DW_AT_type        : <0x698>
 <2><692>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <693>   DW_AT_type        : <0x29>
 <2><697>: Abbrev Number: 0
 <1><698>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <699>   DW_AT_byte_size   : 4
    <69a>   DW_AT_type        : <0x69e>
 <1><69e>: Abbrev Number: 3 (DW_TAG_base_type)
    <69f>   DW_AT_byte_size   : 1
    <6a0>   DW_AT_encoding    : 8	(unsigned char)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x45aea): char
 <1><6a5>: Abbrev Number: 5 (DW_TAG_const_type)
    <6a6>   DW_AT_type        : <0x69e>
 <1><6aa>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6ab>   DW_AT_byte_size   : 4
    <6ac>   DW_AT_type        : <0x67a>
 <1><6b0>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6b1>   DW_AT_prototyped  : 1
    <6b1>   DW_AT_type        : <0x29>
    <6b5>   DW_AT_sibling     : <0x6ce>
 <2><6b9>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6ba>   DW_AT_type        : <0x52c>
 <2><6be>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6bf>   DW_AT_type        : <0xde>
 <2><6c3>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c4>   DW_AT_type        : <0x6ce>
 <2><6c8>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c9>   DW_AT_type        : <0x29>
 <2><6cd>: Abbrev Number: 0
 <1><6ce>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6cf>   DW_AT_byte_size   : 4
    <6d0>   DW_AT_type        : <0x6a5>
 <1><6d4>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6d5>   DW_AT_byte_size   : 4
    <6d6>   DW_AT_type        : <0x6b0>
 <1><6da>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6db>   DW_AT_prototyped  : 1
    <6db>   DW_AT_type        : <0xf9>
    <6df>   DW_AT_sibling     : <0x6f8>
 <2><6e3>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6e4>   DW_AT_type        : <0x52c>
 <2><6e8>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6e9>   DW_AT_type        : <0xde>
 <2><6ed>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6ee>   DW_AT_type        : <0xf9>
 <2><6f2>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6f3>   DW_AT_type        : <0x29>
 <2><6f7>: Abbrev Number: 0
 <1><6f8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6f9>   DW_AT_byte_size   : 4
    <6fa>   DW_AT_type        : <0x6da>
 <1><6fe>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6ff>   DW_AT_prototyped  : 1
    <6ff>   DW_AT_type        : <0x29>
    <703>   DW_AT_sibling     : <0x712>
 <2><707>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <708>   DW_AT_type        : <0x52c>
 <2><70c>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <70d>   DW_AT_type        : <0xde>
 <2><711>: Abbrev Number: 0
 <1><712>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <713>   DW_AT_byte_size   : 4
    <714>   DW_AT_type        : <0x6fe>
 <1><718>: Abbrev Number: 12 (DW_TAG_array_type)
    <719>   DW_AT_type        : <0x58>
    <71d>   DW_AT_sibling     : <0x728>
 <2><721>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <722>   DW_AT_type        : <0x30>
    <726>   DW_AT_upper_bound : 2
 <2><727>: Abbrev Number: 0
 <1><728>: Abbrev Number: 12 (DW_TAG_array_type)
    <729>   DW_AT_type        : <0x58>
    <72d>   DW_AT_sibling     : <0x738>
 <2><731>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <732>   DW_AT_type        : <0x30>
    <736>   DW_AT_upper_bound : 0
 <2><737>: Abbrev Number: 0
 <1><738>: Abbrev Number: 9 (DW_TAG_typedef)
    <739>   DW_AT_name        : (indirect string, offset: 0xaffcc): __FILE
    <73d>   DW_AT_decl_file   : 6
    <73e>   DW_AT_decl_line   : 292
    <740>   DW_AT_decl_column : 26
    <741>   DW_AT_type        : <0x537>
 <1><745>: Abbrev Number: 23 (DW_TAG_structure_type)
    <746>   DW_AT_name        : (indirect string, offset: 0xbceb4): _glue
    <74a>   DW_AT_byte_size   : 12
    <74b>   DW_AT_decl_file   : 6
    <74c>   DW_AT_decl_line   : 296
    <74e>   DW_AT_decl_column : 8
    <74f>   DW_AT_sibling     : <0x77e>
 <2><753>: Abbrev Number: 24 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x82223): _next
    <758>   DW_AT_decl_file   : 6
    <759>   DW_AT_decl_line   : 298
    <75b>   DW_AT_decl_column : 17
    <75c>   DW_AT_type        : <0x77e>
    <760>   DW_AT_data_member_location: 0
 <2><761>: Abbrev Number: 24 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x512f1): _niobs
    <766>   DW_AT_decl_file   : 6
    <767>   DW_AT_decl_line   : 299
    <769>   DW_AT_decl_column : 7
    <76a>   DW_AT_type        : <0x29>
    <76e>   DW_AT_data_member_location: 4
 <2><76f>: Abbrev Number: 24 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x6ec2a): _iobs
    <774>   DW_AT_decl_file   : 6
    <775>   DW_AT_decl_line   : 300
    <777>   DW_AT_decl_column : 11
    <778>   DW_AT_type        : <0x784>
    <77c>   DW_AT_data_member_location: 8
 <2><77d>: Abbrev Number: 0
 <1><77e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <77f>   DW_AT_byte_size   : 4
    <780>   DW_AT_type        : <0x745>
 <1><784>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <785>   DW_AT_byte_size   : 4
    <786>   DW_AT_type        : <0x738>
 <1><78a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <78b>   DW_AT_name        : (indirect string, offset: 0x4b0ab): _rand48
    <78f>   DW_AT_byte_size   : 24
    <790>   DW_AT_decl_file   : 6
    <791>   DW_AT_decl_line   : 324
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_sibling     : <0x7d1>
 <2><798>: Abbrev Number: 24 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0xd7f92): _seed
    <79d>   DW_AT_decl_file   : 6
    <79e>   DW_AT_decl_line   : 325
    <7a0>   DW_AT_decl_column : 18
    <7a1>   DW_AT_type        : <0x7d1>
    <7a5>   DW_AT_data_member_location: 0
 <2><7a6>: Abbrev Number: 24 (DW_TAG_member)
    <7a7>   DW_AT_name        : (indirect string, offset: 0xc9215): _mult
    <7ab>   DW_AT_decl_file   : 6
    <7ac>   DW_AT_decl_line   : 326
    <7ae>   DW_AT_decl_column : 18
    <7af>   DW_AT_type        : <0x7d1>
    <7b3>   DW_AT_data_member_location: 6
 <2><7b4>: Abbrev Number: 24 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x70d1d): _add
    <7b9>   DW_AT_decl_file   : 6
    <7ba>   DW_AT_decl_line   : 327
    <7bc>   DW_AT_decl_column : 18
    <7bd>   DW_AT_type        : <0x66>
    <7c1>   DW_AT_data_member_location: 12
 <2><7c2>: Abbrev Number: 24 (DW_TAG_member)
    <7c3>   DW_AT_name        : (indirect string, offset: 0x8221e): _rand_next
    <7c7>   DW_AT_decl_file   : 6
    <7c8>   DW_AT_decl_line   : 330
    <7ca>   DW_AT_decl_column : 36
    <7cb>   DW_AT_type        : <0x93>
    <7cf>   DW_AT_data_member_location: 16
 <2><7d0>: Abbrev Number: 0
 <1><7d1>: Abbrev Number: 12 (DW_TAG_array_type)
    <7d2>   DW_AT_type        : <0x66>
    <7d6>   DW_AT_sibling     : <0x7e1>
 <2><7da>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <7db>   DW_AT_type        : <0x30>
    <7df>   DW_AT_upper_bound : 2
 <2><7e0>: Abbrev Number: 0
 <1><7e1>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7e2>   DW_AT_name        : (indirect string, offset: 0xa6a61): _mprec
    <7e6>   DW_AT_byte_size   : 16
    <7e7>   DW_AT_decl_file   : 6
    <7e8>   DW_AT_decl_line   : 349
    <7ea>   DW_AT_decl_column : 8
    <7eb>   DW_AT_sibling     : <0x828>
 <2><7ef>: Abbrev Number: 24 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0xdb98d): _result
    <7f4>   DW_AT_decl_file   : 6
    <7f5>   DW_AT_decl_line   : 352
    <7f7>   DW_AT_decl_column : 19
    <7f8>   DW_AT_type        : <0x1f0>
    <7fc>   DW_AT_data_member_location: 0
 <2><7fd>: Abbrev Number: 24 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x88dac): _result_k
    <802>   DW_AT_decl_file   : 6
    <803>   DW_AT_decl_line   : 353
    <805>   DW_AT_decl_column : 7
    <806>   DW_AT_type        : <0x29>
    <80a>   DW_AT_data_member_location: 4
 <2><80b>: Abbrev Number: 24 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x67f25): _p5s
    <810>   DW_AT_decl_file   : 6
    <811>   DW_AT_decl_line   : 354
    <813>   DW_AT_decl_column : 19
    <814>   DW_AT_type        : <0x1f0>
    <818>   DW_AT_data_member_location: 8
 <2><819>: Abbrev Number: 24 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x7e686): _freelist
    <81e>   DW_AT_decl_file   : 6
    <81f>   DW_AT_decl_line   : 355
    <821>   DW_AT_decl_column : 20
    <822>   DW_AT_type        : <0x828>
    <826>   DW_AT_data_member_location: 12
 <2><827>: Abbrev Number: 0
 <1><828>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <829>   DW_AT_byte_size   : 4
    <82a>   DW_AT_type        : <0x1f0>
 <1><82e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <82f>   DW_AT_name        : (indirect string, offset: 0x67eed): _misc_reent
    <833>   DW_AT_byte_size   : 80
    <834>   DW_AT_decl_file   : 6
    <835>   DW_AT_decl_line   : 359
    <837>   DW_AT_decl_column : 8
    <838>   DW_AT_sibling     : <0x8d7>
 <2><83c>: Abbrev Number: 24 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0xc8ddb): _strtok_last
    <841>   DW_AT_decl_file   : 6
    <842>   DW_AT_decl_line   : 362
    <844>   DW_AT_decl_column : 9
    <845>   DW_AT_type        : <0x698>
    <849>   DW_AT_data_member_location: 0
 <2><84a>: Abbrev Number: 24 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x5eb36): _mblen_state
    <84f>   DW_AT_decl_file   : 6
    <850>   DW_AT_decl_line   : 363
    <852>   DW_AT_decl_column : 14
    <853>   DW_AT_type        : <0x15b>
    <857>   DW_AT_data_member_location: 4
 <2><858>: Abbrev Number: 24 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0xc8e01): _wctomb_state
    <85d>   DW_AT_decl_file   : 6
    <85e>   DW_AT_decl_line   : 364
    <860>   DW_AT_decl_column : 14
    <861>   DW_AT_type        : <0x15b>
    <865>   DW_AT_data_member_location: 12
 <2><866>: Abbrev Number: 24 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0xbbae1): _mbtowc_state
    <86b>   DW_AT_decl_file   : 6
    <86c>   DW_AT_decl_line   : 365
    <86e>   DW_AT_decl_column : 14
    <86f>   DW_AT_type        : <0x15b>
    <873>   DW_AT_data_member_location: 20
 <2><874>: Abbrev Number: 24 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x36180): _l64a_buf
    <879>   DW_AT_decl_file   : 6
    <87a>   DW_AT_decl_line   : 366
    <87c>   DW_AT_decl_column : 8
    <87d>   DW_AT_type        : <0x8d7>
    <881>   DW_AT_data_member_location: 28
 <2><882>: Abbrev Number: 24 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0xc757f): _getdate_err
    <887>   DW_AT_decl_file   : 6
    <888>   DW_AT_decl_line   : 367
    <88a>   DW_AT_decl_column : 7
    <88b>   DW_AT_type        : <0x29>
    <88f>   DW_AT_data_member_location: 36
 <2><890>: Abbrev Number: 24 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x6938c): _mbrlen_state
    <895>   DW_AT_decl_file   : 6
    <896>   DW_AT_decl_line   : 368
    <898>   DW_AT_decl_column : 14
    <899>   DW_AT_type        : <0x15b>
    <89d>   DW_AT_data_member_location: 40
 <2><89e>: Abbrev Number: 24 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0xc7c45): _mbrtowc_state
    <8a3>   DW_AT_decl_file   : 6
    <8a4>   DW_AT_decl_line   : 369
    <8a6>   DW_AT_decl_column : 14
    <8a7>   DW_AT_type        : <0x15b>
    <8ab>   DW_AT_data_member_location: 48
 <2><8ac>: Abbrev Number: 24 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x81f10): _mbsrtowcs_state
    <8b1>   DW_AT_decl_file   : 6
    <8b2>   DW_AT_decl_line   : 370
    <8b4>   DW_AT_decl_column : 14
    <8b5>   DW_AT_type        : <0x15b>
    <8b9>   DW_AT_data_member_location: 56
 <2><8ba>: Abbrev Number: 24 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x42a34): _wcrtomb_state
    <8bf>   DW_AT_decl_file   : 6
    <8c0>   DW_AT_decl_line   : 371
    <8c2>   DW_AT_decl_column : 14
    <8c3>   DW_AT_type        : <0x15b>
    <8c7>   DW_AT_data_member_location: 64
 <2><8c8>: Abbrev Number: 24 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x7c784): _wcsrtombs_state
    <8cd>   DW_AT_decl_file   : 6
    <8ce>   DW_AT_decl_line   : 372
    <8d0>   DW_AT_decl_column : 14
    <8d1>   DW_AT_type        : <0x15b>
    <8d5>   DW_AT_data_member_location: 72
 <2><8d6>: Abbrev Number: 0
 <1><8d7>: Abbrev Number: 12 (DW_TAG_array_type)
    <8d8>   DW_AT_type        : <0x69e>
    <8dc>   DW_AT_sibling     : <0x8e7>
 <2><8e0>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <8e1>   DW_AT_type        : <0x30>
    <8e5>   DW_AT_upper_bound : 7
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 17 (DW_TAG_structure_type)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xbceda): __locale_t
    <8ec>   DW_AT_declaration : 1
 <1><8ec>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8ed>   DW_AT_byte_size   : 4
    <8ee>   DW_AT_type        : <0x8e7>
 <1><8f2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <8f3>   DW_AT_byte_size   : 4
    <8f4>   DW_AT_type        : <0x7e1>
 <1><8f8>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <8f9>   DW_AT_prototyped  : 1
    <8f9>   DW_AT_sibling     : <0x903>
 <2><8fd>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <8fe>   DW_AT_type        : <0x52c>
 <2><902>: Abbrev Number: 0
 <1><903>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <904>   DW_AT_byte_size   : 4
    <905>   DW_AT_type        : <0x8f8>
 <1><909>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <90a>   DW_AT_byte_size   : 4
    <90b>   DW_AT_type        : <0x78a>
 <1><90f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <910>   DW_AT_byte_size   : 4
    <911>   DW_AT_type        : <0x206>
 <1><915>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <916>   DW_AT_prototyped  : 1
    <916>   DW_AT_sibling     : <0x920>
 <2><91a>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <91b>   DW_AT_type        : <0x29>
 <2><91f>: Abbrev Number: 0
 <1><920>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <921>   DW_AT_byte_size   : 4
    <922>   DW_AT_type        : <0x926>
 <1><926>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <927>   DW_AT_byte_size   : 4
    <928>   DW_AT_type        : <0x915>
 <1><92c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <92d>   DW_AT_byte_size   : 4
    <92e>   DW_AT_type        : <0x82e>
 <1><932>: Abbrev Number: 29 (DW_TAG_variable)
    <933>   DW_AT_name        : (indirect string, offset: 0x68658): __sf_fake_stdin
    <937>   DW_AT_decl_file   : 6
    <938>   DW_AT_decl_line   : 463
    <93a>   DW_AT_decl_column : 34
    <93b>   DW_AT_type        : <0x3e4>
    <93f>   DW_AT_external    : 1
    <93f>   DW_AT_declaration : 1
 <1><93f>: Abbrev Number: 29 (DW_TAG_variable)
    <940>   DW_AT_name        : (indirect string, offset: 0xdb13d): __sf_fake_stdout
    <944>   DW_AT_decl_file   : 6
    <945>   DW_AT_decl_line   : 464
    <947>   DW_AT_decl_column : 34
    <948>   DW_AT_type        : <0x3e4>
    <94c>   DW_AT_external    : 1
    <94c>   DW_AT_declaration : 1
 <1><94c>: Abbrev Number: 29 (DW_TAG_variable)
    <94d>   DW_AT_name        : (indirect string, offset: 0xda188): __sf_fake_stderr
    <951>   DW_AT_decl_file   : 6
    <952>   DW_AT_decl_line   : 465
    <954>   DW_AT_decl_column : 34
    <955>   DW_AT_type        : <0x3e4>
    <959>   DW_AT_external    : 1
    <959>   DW_AT_declaration : 1
 <1><959>: Abbrev Number: 29 (DW_TAG_variable)
    <95a>   DW_AT_name        : (indirect string, offset: 0x33221): _impure_ptr
    <95e>   DW_AT_decl_file   : 6
    <95f>   DW_AT_decl_line   : 819
    <961>   DW_AT_decl_column : 23
    <962>   DW_AT_type        : <0x52c>
    <966>   DW_AT_external    : 1
    <966>   DW_AT_declaration : 1
 <1><966>: Abbrev Number: 29 (DW_TAG_variable)
    <967>   DW_AT_name        : (indirect string, offset: 0x3a02f): _global_impure_ptr
    <96b>   DW_AT_decl_file   : 6
    <96c>   DW_AT_decl_line   : 820
    <96e>   DW_AT_decl_column : 29
    <96f>   DW_AT_type        : <0x532>
    <973>   DW_AT_external    : 1
    <973>   DW_AT_declaration : 1
 <1><973>: Abbrev Number: 29 (DW_TAG_variable)
    <974>   DW_AT_name        : (indirect string, offset: 0x4285): _global_atexit
    <978>   DW_AT_decl_file   : 6
    <979>   DW_AT_decl_line   : 838
    <97b>   DW_AT_decl_column : 24
    <97c>   DW_AT_type        : <0x320>
    <980>   DW_AT_external    : 1
    <980>   DW_AT_declaration : 1
 <1><980>: Abbrev Number: 4 (DW_TAG_typedef)
    <981>   DW_AT_name        : (indirect string, offset: 0xbf89b): TaskHandle_t
    <985>   DW_AT_decl_file   : 9
    <986>   DW_AT_decl_line   : 70
    <987>   DW_AT_decl_column : 37
    <988>   DW_AT_type        : <0x98c>
 <1><98c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <98d>   DW_AT_byte_size   : 4
    <98e>   DW_AT_type        : <0x992>
 <1><992>: Abbrev Number: 17 (DW_TAG_structure_type)
    <993>   DW_AT_name        : (indirect string, offset: 0xbb245): tskTaskControlBlock
    <997>   DW_AT_declaration : 1
 <1><997>: Abbrev Number: 29 (DW_TAG_variable)
    <998>   DW_AT_name        : (indirect string, offset: 0x4e62): ITM_RxBuffer
    <99c>   DW_AT_decl_file   : 10
    <99d>   DW_AT_decl_line   : 2047
    <99f>   DW_AT_decl_column : 25
    <9a0>   DW_AT_type        : <0xb7>
    <9a4>   DW_AT_external    : 1
    <9a4>   DW_AT_declaration : 1
 <1><9a4>: Abbrev Number: 12 (DW_TAG_array_type)
    <9a5>   DW_AT_type        : <0xa6>
    <9a9>   DW_AT_sibling     : <0x9b4>
 <2><9ad>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <9ae>   DW_AT_type        : <0x30>
    <9b2>   DW_AT_upper_bound : 15
 <2><9b3>: Abbrev Number: 0
 <1><9b4>: Abbrev Number: 5 (DW_TAG_const_type)
    <9b5>   DW_AT_type        : <0x9a4>
 <1><9b9>: Abbrev Number: 7 (DW_TAG_variable)
    <9ba>   DW_AT_name        : (indirect string, offset: 0xc74c0): AHBPrescTable
    <9be>   DW_AT_decl_file   : 11
    <9bf>   DW_AT_decl_line   : 59
    <9c0>   DW_AT_decl_column : 23
    <9c1>   DW_AT_type        : <0x9b4>
    <9c5>   DW_AT_external    : 1
    <9c5>   DW_AT_declaration : 1
 <1><9c5>: Abbrev Number: 12 (DW_TAG_array_type)
    <9c6>   DW_AT_type        : <0xa6>
    <9ca>   DW_AT_sibling     : <0x9d5>
 <2><9ce>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <9cf>   DW_AT_type        : <0x30>
    <9d3>   DW_AT_upper_bound : 7
 <2><9d4>: Abbrev Number: 0
 <1><9d5>: Abbrev Number: 5 (DW_TAG_const_type)
    <9d6>   DW_AT_type        : <0x9c5>
 <1><9da>: Abbrev Number: 7 (DW_TAG_variable)
    <9db>   DW_AT_name        : (indirect string, offset: 0x8cfd6): APBPrescTable
    <9df>   DW_AT_decl_file   : 11
    <9e0>   DW_AT_decl_line   : 60
    <9e1>   DW_AT_decl_column : 23
    <9e2>   DW_AT_type        : <0x9d5>
    <9e6>   DW_AT_external    : 1
    <9e6>   DW_AT_declaration : 1
 <1><9e6>: Abbrev Number: 12 (DW_TAG_array_type)
    <9e7>   DW_AT_type        : <0xcd>
    <9eb>   DW_AT_sibling     : <0x9f6>
 <2><9ef>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <9f0>   DW_AT_type        : <0x30>
    <9f4>   DW_AT_upper_bound : 11
 <2><9f5>: Abbrev Number: 0
 <1><9f6>: Abbrev Number: 5 (DW_TAG_const_type)
    <9f7>   DW_AT_type        : <0x9e6>
 <1><9fb>: Abbrev Number: 7 (DW_TAG_variable)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x98167): MSIRangeTable
    <a00>   DW_AT_decl_file   : 11
    <a01>   DW_AT_decl_line   : 61
    <a02>   DW_AT_decl_column : 23
    <a03>   DW_AT_type        : <0x9f6>
    <a07>   DW_AT_external    : 1
    <a07>   DW_AT_declaration : 1
 <1><a07>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <a08>   DW_AT_encoding    : 7	(unsigned)
    <a09>   DW_AT_byte_size   : 1
    <a0a>   DW_AT_type        : <0x58>
    <a0e>   DW_AT_decl_file   : 12
    <a0f>   DW_AT_decl_line   : 50
    <a10>   DW_AT_decl_column : 1
    <a11>   DW_AT_sibling     : <0xa22>
 <2><a15>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a16>   DW_AT_name        : (indirect string, offset: 0xa1f22): HAL_UNLOCKED
    <a1a>   DW_AT_const_value : 0
 <2><a1b>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xdbeba): HAL_LOCKED
    <a20>   DW_AT_const_value : 1
 <2><a21>: Abbrev Number: 0
 <1><a22>: Abbrev Number: 4 (DW_TAG_typedef)
    <a23>   DW_AT_name        : (indirect string, offset: 0x80eb3): HAL_LockTypeDef
    <a27>   DW_AT_decl_file   : 12
    <a28>   DW_AT_decl_line   : 53
    <a29>   DW_AT_decl_column : 3
    <a2a>   DW_AT_type        : <0xa07>
 <1><a2e>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <a2f>   DW_AT_encoding    : 7	(unsigned)
    <a30>   DW_AT_byte_size   : 1
    <a31>   DW_AT_type        : <0x58>
    <a35>   DW_AT_decl_file   : 13
    <a36>   DW_AT_decl_line   : 101
    <a37>   DW_AT_decl_column : 1
    <a38>   DW_AT_sibling     : <0xa5b>
 <2><a3c>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x7e725): FLASH_PROC_NONE
    <a41>   DW_AT_const_value : 0
 <2><a42>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0x6983): FLASH_PROC_PAGE_ERASE
    <a47>   DW_AT_const_value : 1
 <2><a48>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x67bb0): FLASH_PROC_MASS_ERASE
    <a4d>   DW_AT_const_value : 2
 <2><a4e>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x1fd11): FLASH_PROC_PROGRAM
    <a53>   DW_AT_const_value : 3
 <2><a54>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x51832): FLASH_PROC_PROGRAM_LAST
    <a59>   DW_AT_const_value : 4
 <2><a5a>: Abbrev Number: 0
 <1><a5b>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x3b3ef): FLASH_ProcedureTypeDef
    <a60>   DW_AT_decl_file   : 13
    <a61>   DW_AT_decl_line   : 107
    <a62>   DW_AT_decl_column : 3
    <a63>   DW_AT_type        : <0xa2e>
 <1><a67>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <a68>   DW_AT_type        : <0xa5b>
 <1><a6c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <a6d>   DW_AT_encoding    : 7	(unsigned)
    <a6e>   DW_AT_byte_size   : 1
    <a6f>   DW_AT_type        : <0x58>
    <a73>   DW_AT_decl_file   : 13
    <a74>   DW_AT_decl_line   : 113
    <a75>   DW_AT_decl_column : 1
    <a76>   DW_AT_sibling     : <0xa93>
 <2><a7a>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x12fd5): FLASH_CACHE_DISABLED
    <a7f>   DW_AT_const_value : 0
 <2><a80>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0x4e98c): FLASH_CACHE_ICACHE_ENABLED
    <a85>   DW_AT_const_value : 1
 <2><a86>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a87>   DW_AT_name        : (indirect string, offset: 0xb5807): FLASH_CACHE_DCACHE_ENABLED
    <a8b>   DW_AT_const_value : 2
 <2><a8c>: Abbrev Number: 31 (DW_TAG_enumerator)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x42110): FLASH_CACHE_ICACHE_DCACHE_ENABLED
    <a91>   DW_AT_const_value : 3
 <2><a92>: Abbrev Number: 0
 <1><a93>: Abbrev Number: 4 (DW_TAG_typedef)
    <a94>   DW_AT_name        : (indirect string, offset: 0x91af3): FLASH_CacheTypeDef
    <a98>   DW_AT_decl_file   : 13
    <a99>   DW_AT_decl_line   : 118
    <a9a>   DW_AT_decl_column : 3
    <a9b>   DW_AT_type        : <0xa6c>
 <1><a9f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <aa0>   DW_AT_type        : <0xa93>
 <1><aa4>: Abbrev Number: 14 (DW_TAG_structure_type)
    <aa5>   DW_AT_byte_size   : 32
    <aa6>   DW_AT_decl_file   : 13
    <aa7>   DW_AT_decl_line   : 123
    <aa8>   DW_AT_decl_column : 9
    <aa9>   DW_AT_sibling     : <0xb16>
 <2><aad>: Abbrev Number: 15 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0xe52f9): Lock
    <ab2>   DW_AT_decl_file   : 13
    <ab3>   DW_AT_decl_line   : 125
    <ab4>   DW_AT_decl_column : 31
    <ab5>   DW_AT_type        : <0xa22>
    <ab9>   DW_AT_data_member_location: 0
 <2><aba>: Abbrev Number: 15 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0xd71df): ErrorCode
    <abf>   DW_AT_decl_file   : 13
    <ac0>   DW_AT_decl_line   : 126
    <ac1>   DW_AT_decl_column : 31
    <ac2>   DW_AT_type        : <0xc8>
    <ac6>   DW_AT_data_member_location: 4
 <2><ac7>: Abbrev Number: 15 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x6de2d): ProcedureOnGoing
    <acc>   DW_AT_decl_file   : 13
    <acd>   DW_AT_decl_line   : 127
    <ace>   DW_AT_decl_column : 31
    <acf>   DW_AT_type        : <0xa67>
    <ad3>   DW_AT_data_member_location: 8
 <2><ad4>: Abbrev Number: 15 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xe5257): Address
    <ad9>   DW_AT_decl_file   : 13
    <ada>   DW_AT_decl_line   : 128
    <adb>   DW_AT_decl_column : 31
    <adc>   DW_AT_type        : <0xc8>
    <ae0>   DW_AT_data_member_location: 12
 <2><ae1>: Abbrev Number: 15 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0xe3ffa): Bank
    <ae6>   DW_AT_decl_file   : 13
    <ae7>   DW_AT_decl_line   : 129
    <ae8>   DW_AT_decl_column : 31
    <ae9>   DW_AT_type        : <0xc8>
    <aed>   DW_AT_data_member_location: 16
 <2><aee>: Abbrev Number: 15 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0xa75b6): Page
    <af3>   DW_AT_decl_file   : 13
    <af4>   DW_AT_decl_line   : 130
    <af5>   DW_AT_decl_column : 31
    <af6>   DW_AT_type        : <0xc8>
    <afa>   DW_AT_data_member_location: 20
 <2><afb>: Abbrev Number: 15 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x2d393): NbPagesToErase
    <b00>   DW_AT_decl_file   : 13
    <b01>   DW_AT_decl_line   : 131
    <b02>   DW_AT_decl_column : 31
    <b03>   DW_AT_type        : <0xc8>
    <b07>   DW_AT_data_member_location: 24
 <2><b08>: Abbrev Number: 15 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0xd5794): CacheToReactivate
    <b0d>   DW_AT_decl_file   : 13
    <b0e>   DW_AT_decl_line   : 132
    <b0f>   DW_AT_decl_column : 31
    <b10>   DW_AT_type        : <0xa9f>
    <b14>   DW_AT_data_member_location: 28
 <2><b15>: Abbrev Number: 0
 <1><b16>: Abbrev Number: 4 (DW_TAG_typedef)
    <b17>   DW_AT_name        : (indirect string, offset: 0x4114f): FLASH_ProcessTypeDef
    <b1b>   DW_AT_decl_file   : 13
    <b1c>   DW_AT_decl_line   : 133
    <b1d>   DW_AT_decl_column : 2
    <b1e>   DW_AT_type        : <0xaa4>
 <1><b22>: Abbrev Number: 29 (DW_TAG_variable)
    <b23>   DW_AT_name        : (indirect string, offset: 0x9cf7c): pFlash
    <b27>   DW_AT_decl_file   : 13
    <b28>   DW_AT_decl_line   : 825
    <b2a>   DW_AT_decl_column : 29
    <b2b>   DW_AT_type        : <0xb16>
    <b2f>   DW_AT_external    : 1
    <b2f>   DW_AT_declaration : 1
 <1><b2f>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b30>   DW_AT_encoding    : 7	(unsigned)
    <b31>   DW_AT_byte_size   : 1
    <b32>   DW_AT_type        : <0x58>
    <b36>   DW_AT_decl_file   : 14
    <b37>   DW_AT_decl_line   : 48
    <b38>   DW_AT_decl_column : 1
    <b39>   DW_AT_sibling     : <0xb56>
 <2><b3d>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x706b1): HAL_TICK_FREQ_10HZ
    <b42>   DW_AT_const_value : 100
 <2><b43>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b44>   DW_AT_name        : (indirect string, offset: 0x50118): HAL_TICK_FREQ_100HZ
    <b48>   DW_AT_const_value : 10
 <2><b49>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x660a3): HAL_TICK_FREQ_1KHZ
    <b4e>   DW_AT_const_value : 1
 <2><b4f>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b50>   DW_AT_name        : (indirect string, offset: 0x4dd46): HAL_TICK_FREQ_DEFAULT
    <b54>   DW_AT_const_value : 1
 <2><b55>: Abbrev Number: 0
 <1><b56>: Abbrev Number: 4 (DW_TAG_typedef)
    <b57>   DW_AT_name        : (indirect string, offset: 0xad2c6): HAL_TickFreqTypeDef
    <b5b>   DW_AT_decl_file   : 14
    <b5c>   DW_AT_decl_line   : 53
    <b5d>   DW_AT_decl_column : 3
    <b5e>   DW_AT_type        : <0xb2f>
 <1><b62>: Abbrev Number: 29 (DW_TAG_variable)
    <b63>   DW_AT_name        : (indirect string, offset: 0x320f9): uwTick
    <b67>   DW_AT_decl_file   : 14
    <b68>   DW_AT_decl_line   : 618
    <b6a>   DW_AT_decl_column : 22
    <b6b>   DW_AT_type        : <0xc8>
    <b6f>   DW_AT_external    : 1
    <b6f>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 29 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0xa4582): uwTickPrio
    <b74>   DW_AT_decl_file   : 14
    <b75>   DW_AT_decl_line   : 619
    <b77>   DW_AT_decl_column : 17
    <b78>   DW_AT_type        : <0xbc>
    <b7c>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7c>: Abbrev Number: 29 (DW_TAG_variable)
    <b7d>   DW_AT_name        : (indirect string, offset: 0xc6dea): uwTickFreq
    <b81>   DW_AT_decl_file   : 14
    <b82>   DW_AT_decl_line   : 620
    <b84>   DW_AT_decl_column : 28
    <b85>   DW_AT_type        : <0xb56>
    <b89>   DW_AT_external    : 1
    <b89>   DW_AT_declaration : 1
 <1><b89>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b8a>   DW_AT_external    : 1
    <b8a>   DW_AT_name        : (indirect string, offset: 0x4ed36): vApplicationStackOverflowHook
    <b8e>   DW_AT_decl_file   : 1
    <b8f>   DW_AT_decl_line   : 74
    <b90>   DW_AT_decl_column : 6
    <b91>   DW_AT_prototyped  : 1
    <b91>   DW_AT_low_pc      : 0x800100a
    <b95>   DW_AT_high_pc     : 0x16
    <b99>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b9b>   DW_AT_GNU_all_call_sites: 1
    <b9b>   DW_AT_sibling     : <0xbbe>
 <2><b9f>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <ba0>   DW_AT_name        : (indirect string, offset: 0xecb0d): xTask
    <ba4>   DW_AT_decl_file   : 1
    <ba5>   DW_AT_decl_line   : 74
    <ba6>   DW_AT_decl_column : 48
    <ba7>   DW_AT_type        : <0x980>
    <bab>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bae>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <baf>   DW_AT_name        : (indirect string, offset: 0x49ee6): pcTaskName
    <bb3>   DW_AT_decl_file   : 1
    <bb4>   DW_AT_decl_line   : 74
    <bb5>   DW_AT_decl_column : 68
    <bb6>   DW_AT_type        : <0xbbe>
    <bba>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><bbd>: Abbrev Number: 0
 <1><bbe>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <bbf>   DW_AT_byte_size   : 4
    <bc0>   DW_AT_type        : <0x45>
 <1><bc4>: Abbrev Number: 34 (DW_TAG_subprogram)
    <bc5>   DW_AT_external    : 1
    <bc5>   DW_AT_name        : (indirect string, offset: 0x634b4): getRunTimeCounterValue
    <bc9>   DW_AT_decl_file   : 1
    <bca>   DW_AT_decl_line   : 67
    <bcb>   DW_AT_decl_column : 22
    <bcc>   DW_AT_prototyped  : 1
    <bcc>   DW_AT_type        : <0x8c>
    <bd0>   DW_AT_low_pc      : 0x8000ffa
    <bd4>   DW_AT_high_pc     : 0x10
    <bd8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bda>   DW_AT_GNU_all_call_sites: 1
 <1><bda>: Abbrev Number: 35 (DW_TAG_subprogram)
    <bdb>   DW_AT_external    : 1
    <bdb>   DW_AT_name        : (indirect string, offset: 0x2d76c): configureTimerForRunTimeStats
    <bdf>   DW_AT_decl_file   : 1
    <be0>   DW_AT_decl_line   : 62
    <be1>   DW_AT_decl_column : 13
    <be2>   DW_AT_prototyped  : 1
    <be2>   DW_AT_low_pc      : 0x8000fec
    <be6>   DW_AT_high_pc     : 0xe
    <bea>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bec>   DW_AT_GNU_all_call_sites: 1
 <1><bec>: Abbrev Number: 0
  Compilation Unit @ offset 0xbed:
   Length:        0x2fd6 (32-bit)
   Version:       4
   Abbrev Offset: 0x200
   Pointer Size:  4
 <0><bf8>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bf9>   DW_AT_producer    : (indirect string, offset: 0x26648): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <bfd>   DW_AT_language    : 12	(ANSI C99)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xe17cd): ../Core/Src/main.c
    <c02>   DW_AT_comp_dir    : (indirect string, offset: 0x55f8): C:/Projekty/Battery_4_uI_R1/fw/STM32Cube_v2/MIBattController/Debug
    <c06>   DW_AT_ranges      : 0x20
    <c0a>   DW_AT_low_pc      : 0x0
    <c0e>   DW_AT_stmt_list   : 0x98c
    <c12>   DW_AT_GNU_macros  : 0x21984
 <1><c16>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <c17>   DW_AT_encoding    : 5	(signed)
    <c18>   DW_AT_byte_size   : 1
    <c19>   DW_AT_type        : <0xddb>
    <c1d>   DW_AT_decl_file   : 7
    <c1e>   DW_AT_decl_line   : 66
    <c1f>   DW_AT_decl_column : 1
    <c20>   DW_AT_sibling     : <0xddb>
 <2><c24>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c25>   DW_AT_name        : (indirect string, offset: 0xdd936): NonMaskableInt_IRQn
    <c29>   DW_AT_const_value : -14
 <2><c2a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c2b>   DW_AT_name        : (indirect string, offset: 0xe0666): HardFault_IRQn
    <c2f>   DW_AT_const_value : -13
 <2><c30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c31>   DW_AT_name        : (indirect string, offset: 0xdd440): MemoryManagement_IRQn
    <c35>   DW_AT_const_value : -12
 <2><c36>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c37>   DW_AT_name        : (indirect string, offset: 0xe0d0e): BusFault_IRQn
    <c3b>   DW_AT_const_value : -11
 <2><c3c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xe03f6): UsageFault_IRQn
    <c41>   DW_AT_const_value : -10
 <2><c42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c43>   DW_AT_name        : (indirect string, offset: 0xdcf1b): SVCall_IRQn
    <c47>   DW_AT_const_value : -5
 <2><c48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c49>   DW_AT_name        : (indirect string, offset: 0xdf676): DebugMonitor_IRQn
    <c4d>   DW_AT_const_value : -4
 <2><c4e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c4f>   DW_AT_name        : (indirect string, offset: 0xdfac7): PendSV_IRQn
    <c53>   DW_AT_const_value : -2
 <2><c54>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c55>   DW_AT_name        : (indirect string, offset: 0xe0eb8): SysTick_IRQn
    <c59>   DW_AT_const_value : -1
 <2><c5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xe061e): WWDG_IRQn
    <c5f>   DW_AT_const_value : 0
 <2><c60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c61>   DW_AT_name        : (indirect string, offset: 0xe1ace): PVD_PVM_IRQn
    <c65>   DW_AT_const_value : 1
 <2><c66>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c67>   DW_AT_name        : (indirect string, offset: 0xe1db1): TAMP_STAMP_IRQn
    <c6b>   DW_AT_const_value : 2
 <2><c6c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c6d>   DW_AT_name        : (indirect string, offset: 0xdfeb8): RTC_WKUP_IRQn
    <c71>   DW_AT_const_value : 3
 <2><c72>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c73>   DW_AT_name        : (indirect string, offset: 0xde119): FLASH_IRQn
    <c77>   DW_AT_const_value : 4
 <2><c78>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c79>   DW_AT_name        : (indirect string, offset: 0xe1b36): RCC_IRQn
    <c7d>   DW_AT_const_value : 5
 <2><c7e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xdf6a6): EXTI0_IRQn
    <c83>   DW_AT_const_value : 6
 <2><c84>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c85>   DW_AT_name        : (indirect string, offset: 0xe1c89): EXTI1_IRQn
    <c89>   DW_AT_const_value : 7
 <2><c8a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c8b>   DW_AT_name        : (indirect string, offset: 0xdeffe): EXTI2_IRQn
    <c8f>   DW_AT_const_value : 8
 <2><c90>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c91>   DW_AT_name        : (indirect string, offset: 0xe0f47): EXTI3_IRQn
    <c95>   DW_AT_const_value : 9
 <2><c96>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c97>   DW_AT_name        : (indirect string, offset: 0xddf21): EXTI4_IRQn
    <c9b>   DW_AT_const_value : 10
 <2><c9c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xde52f): DMA1_Channel1_IRQn
    <ca1>   DW_AT_const_value : 11
 <2><ca2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ca3>   DW_AT_name        : (indirect string, offset: 0xe0959): DMA1_Channel2_IRQn
    <ca7>   DW_AT_const_value : 12
 <2><ca8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xe0c14): DMA1_Channel3_IRQn
    <cad>   DW_AT_const_value : 13
 <2><cae>: Abbrev Number: 4 (DW_TAG_enumerator)
    <caf>   DW_AT_name        : (indirect string, offset: 0xdfd4b): DMA1_Channel4_IRQn
    <cb3>   DW_AT_const_value : 14
 <2><cb4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cb5>   DW_AT_name        : (indirect string, offset: 0xdd127): DMA1_Channel5_IRQn
    <cb9>   DW_AT_const_value : 15
 <2><cba>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cbb>   DW_AT_name        : (indirect string, offset: 0xdf259): DMA1_Channel6_IRQn
    <cbf>   DW_AT_const_value : 16
 <2><cc0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xe17e6): DMA1_Channel7_IRQn
    <cc5>   DW_AT_const_value : 17
 <2><cc6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x22fcb): ADC1_IRQn
    <ccb>   DW_AT_const_value : 18
 <2><ccc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xe18f6): CAN1_TX_IRQn
    <cd1>   DW_AT_const_value : 19
 <2><cd2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xde066): CAN1_RX0_IRQn
    <cd7>   DW_AT_const_value : 20
 <2><cd8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xe0492): CAN1_RX1_IRQn
    <cdd>   DW_AT_const_value : 21
 <2><cde>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cdf>   DW_AT_name        : (indirect string, offset: 0xe0477): CAN1_SCE_IRQn
    <ce3>   DW_AT_const_value : 22
 <2><ce4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xe17f9): EXTI9_5_IRQn
    <ce9>   DW_AT_const_value : 23
 <2><cea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xe0d30): TIM1_BRK_TIM15_IRQn
    <cef>   DW_AT_const_value : 24
 <2><cf0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cf1>   DW_AT_name        : (indirect string, offset: 0xde41c): TIM1_UP_TIM16_IRQn
    <cf5>   DW_AT_const_value : 25
 <2><cf6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x366e0): TIM1_TRG_COM_IRQn
    <cfb>   DW_AT_const_value : 26
 <2><cfc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cfd>   DW_AT_name        : (indirect string, offset: 0xdf435): TIM1_CC_IRQn
    <d01>   DW_AT_const_value : 27
 <2><d02>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d03>   DW_AT_name        : (indirect string, offset: 0xde21a): TIM2_IRQn
    <d07>   DW_AT_const_value : 28
 <2><d08>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d09>   DW_AT_name        : (indirect string, offset: 0xdeb11): I2C1_EV_IRQn
    <d0d>   DW_AT_const_value : 31
 <2><d0e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0f>   DW_AT_name        : (indirect string, offset: 0xe00e2): I2C1_ER_IRQn
    <d13>   DW_AT_const_value : 32
 <2><d14>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d15>   DW_AT_name        : (indirect string, offset: 0xdf0f5): I2C2_EV_IRQn
    <d19>   DW_AT_const_value : 33
 <2><d1a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d1b>   DW_AT_name        : (indirect string, offset: 0xdef96): I2C2_ER_IRQn
    <d1f>   DW_AT_const_value : 34
 <2><d20>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d21>   DW_AT_name        : (indirect string, offset: 0xdd6c1): SPI1_IRQn
    <d25>   DW_AT_const_value : 35
 <2><d26>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d27>   DW_AT_name        : (indirect string, offset: 0xdfcfb): SPI2_IRQn
    <d2b>   DW_AT_const_value : 36
 <2><d2c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xe0d71): USART1_IRQn
    <d31>   DW_AT_const_value : 37
 <2><d32>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d33>   DW_AT_name        : (indirect string, offset: 0xde331): USART2_IRQn
    <d37>   DW_AT_const_value : 38
 <2><d38>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d39>   DW_AT_name        : (indirect string, offset: 0xe0675): USART3_IRQn
    <d3d>   DW_AT_const_value : 39
 <2><d3e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d3f>   DW_AT_name        : (indirect string, offset: 0xe11b2): EXTI15_10_IRQn
    <d43>   DW_AT_const_value : 40
 <2><d44>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d45>   DW_AT_name        : (indirect string, offset: 0xe124a): RTC_Alarm_IRQn
    <d49>   DW_AT_const_value : 41
 <2><d4a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xbd0d9): SDMMC1_IRQn
    <d4f>   DW_AT_const_value : 49
 <2><d50>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d51>   DW_AT_name        : (indirect string, offset: 0xe1eb5): SPI3_IRQn
    <d55>   DW_AT_const_value : 51
 <2><d56>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d57>   DW_AT_name        : (indirect string, offset: 0xa399f): TIM6_DAC_IRQn
    <d5b>   DW_AT_const_value : 54
 <2><d5c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d5d>   DW_AT_name        : (indirect string, offset: 0xdeb00): TIM7_IRQn
    <d61>   DW_AT_const_value : 55
 <2><d62>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d63>   DW_AT_name        : (indirect string, offset: 0xdf9fc): DMA2_Channel1_IRQn
    <d67>   DW_AT_const_value : 56
 <2><d68>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d69>   DW_AT_name        : (indirect string, offset: 0xe1c34): DMA2_Channel2_IRQn
    <d6d>   DW_AT_const_value : 57
 <2><d6e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d6f>   DW_AT_name        : (indirect string, offset: 0xdfe18): DMA2_Channel3_IRQn
    <d73>   DW_AT_const_value : 58
 <2><d74>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d75>   DW_AT_name        : (indirect string, offset: 0xe12b7): DMA2_Channel4_IRQn
    <d79>   DW_AT_const_value : 59
 <2><d7a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d7b>   DW_AT_name        : (indirect string, offset: 0xde4eb): DMA2_Channel5_IRQn
    <d7f>   DW_AT_const_value : 60
 <2><d80>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d81>   DW_AT_name        : (indirect string, offset: 0xe21c6): COMP_IRQn
    <d85>   DW_AT_const_value : 64
 <2><d86>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d87>   DW_AT_name        : (indirect string, offset: 0xe0ce7): LPTIM1_IRQn
    <d8b>   DW_AT_const_value : 65
 <2><d8c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xde218): LPTIM2_IRQn
    <d91>   DW_AT_const_value : 66
 <2><d92>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0xe0888): DMA2_Channel6_IRQn
    <d97>   DW_AT_const_value : 68
 <2><d98>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d99>   DW_AT_name        : (indirect string, offset: 0xddb56): DMA2_Channel7_IRQn
    <d9d>   DW_AT_const_value : 69
 <2><d9e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d9f>   DW_AT_name        : (indirect string, offset: 0xe03e9): LPUART1_IRQn
    <da3>   DW_AT_const_value : 70
 <2><da4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0xdf6b1): QUADSPI_IRQn
    <da9>   DW_AT_const_value : 71
 <2><daa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0xe1ddf): I2C3_EV_IRQn
    <daf>   DW_AT_const_value : 72
 <2><db0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0xddb8f): I2C3_ER_IRQn
    <db5>   DW_AT_const_value : 73
 <2><db6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0xdefe2): SAI1_IRQn
    <dbb>   DW_AT_const_value : 74
 <2><dbc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xe1d33): SWPMI1_IRQn
    <dc1>   DW_AT_const_value : 76
 <2><dc2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc3>   DW_AT_name        : (indirect string, offset: 0xdef14): TSC_IRQn
    <dc7>   DW_AT_const_value : 77
 <2><dc8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x9f461): RNG_IRQn
    <dcd>   DW_AT_const_value : 80
 <2><dce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dcf>   DW_AT_name        : (indirect string, offset: 0xdea41): FPU_IRQn
    <dd3>   DW_AT_const_value : 81
 <2><dd4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x8a910): CRS_IRQn
    <dd9>   DW_AT_const_value : 82
 <2><dda>: Abbrev Number: 0
 <1><ddb>: Abbrev Number: 5 (DW_TAG_base_type)
    <ddc>   DW_AT_byte_size   : 1
    <ddd>   DW_AT_encoding    : 6	(signed char)
    <dde>   DW_AT_name        : (indirect string, offset: 0x6db1a): signed char
 <1><de2>: Abbrev Number: 6 (DW_TAG_typedef)
    <de3>   DW_AT_name        : (indirect string, offset: 0x3ed9b): __uint8_t
    <de7>   DW_AT_decl_file   : 3
    <de8>   DW_AT_decl_line   : 43
    <de9>   DW_AT_decl_column : 24
    <dea>   DW_AT_type        : <0xdee>
 <1><dee>: Abbrev Number: 5 (DW_TAG_base_type)
    <def>   DW_AT_byte_size   : 1
    <df0>   DW_AT_encoding    : 8	(unsigned char)
    <df1>   DW_AT_name        : (indirect string, offset: 0xd459a): unsigned char
 <1><df5>: Abbrev Number: 5 (DW_TAG_base_type)
    <df6>   DW_AT_byte_size   : 2
    <df7>   DW_AT_encoding    : 5	(signed)
    <df8>   DW_AT_name        : (indirect string, offset: 0xa30c0): short int
 <1><dfc>: Abbrev Number: 6 (DW_TAG_typedef)
    <dfd>   DW_AT_name        : (indirect string, offset: 0xe1005): __uint16_t
    <e01>   DW_AT_decl_file   : 3
    <e02>   DW_AT_decl_line   : 57
    <e03>   DW_AT_decl_column : 25
    <e04>   DW_AT_type        : <0xe08>
 <1><e08>: Abbrev Number: 5 (DW_TAG_base_type)
    <e09>   DW_AT_byte_size   : 2
    <e0a>   DW_AT_encoding    : 7	(unsigned)
    <e0b>   DW_AT_name        : (indirect string, offset: 0xd2c06): short unsigned int
 <1><e0f>: Abbrev Number: 6 (DW_TAG_typedef)
    <e10>   DW_AT_name        : (indirect string, offset: 0x86f35): __int32_t
    <e14>   DW_AT_decl_file   : 3
    <e15>   DW_AT_decl_line   : 77
    <e16>   DW_AT_decl_column : 24
    <e17>   DW_AT_type        : <0xe1b>
 <1><e1b>: Abbrev Number: 5 (DW_TAG_base_type)
    <e1c>   DW_AT_byte_size   : 4
    <e1d>   DW_AT_encoding    : 5	(signed)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x12961): long int
 <1><e22>: Abbrev Number: 6 (DW_TAG_typedef)
    <e23>   DW_AT_name        : (indirect string, offset: 0x8bfb6): __uint32_t
    <e27>   DW_AT_decl_file   : 3
    <e28>   DW_AT_decl_line   : 79
    <e29>   DW_AT_decl_column : 25
    <e2a>   DW_AT_type        : <0xe2e>
 <1><e2e>: Abbrev Number: 5 (DW_TAG_base_type)
    <e2f>   DW_AT_byte_size   : 4
    <e30>   DW_AT_encoding    : 7	(unsigned)
    <e31>   DW_AT_name        : (indirect string, offset: 0x52c7a): long unsigned int
 <1><e35>: Abbrev Number: 5 (DW_TAG_base_type)
    <e36>   DW_AT_byte_size   : 8
    <e37>   DW_AT_encoding    : 5	(signed)
    <e38>   DW_AT_name        : (indirect string, offset: 0x63872): long long int
 <1><e3c>: Abbrev Number: 6 (DW_TAG_typedef)
    <e3d>   DW_AT_name        : (indirect string, offset: 0xdf42a): __uint64_t
    <e41>   DW_AT_decl_file   : 3
    <e42>   DW_AT_decl_line   : 105
    <e43>   DW_AT_decl_column : 25
    <e44>   DW_AT_type        : <0xe48>
 <1><e48>: Abbrev Number: 5 (DW_TAG_base_type)
    <e49>   DW_AT_byte_size   : 8
    <e4a>   DW_AT_encoding    : 7	(unsigned)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x2d40b): long long unsigned int
 <1><e4f>: Abbrev Number: 7 (DW_TAG_base_type)
    <e50>   DW_AT_byte_size   : 4
    <e51>   DW_AT_encoding    : 5	(signed)
    <e52>   DW_AT_name        : int
 <1><e56>: Abbrev Number: 5 (DW_TAG_base_type)
    <e57>   DW_AT_byte_size   : 4
    <e58>   DW_AT_encoding    : 7	(unsigned)
    <e59>   DW_AT_name        : (indirect string, offset: 0x11fe0): unsigned int
 <1><e5d>: Abbrev Number: 6 (DW_TAG_typedef)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x3ed9d): uint8_t
    <e62>   DW_AT_decl_file   : 4
    <e63>   DW_AT_decl_line   : 24
    <e64>   DW_AT_decl_column : 19
    <e65>   DW_AT_type        : <0xde2>
 <1><e69>: Abbrev Number: 8 (DW_TAG_const_type)
    <e6a>   DW_AT_type        : <0xe5d>
 <1><e6e>: Abbrev Number: 6 (DW_TAG_typedef)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x9fe89): uint16_t
    <e73>   DW_AT_decl_file   : 4
    <e74>   DW_AT_decl_line   : 36
    <e75>   DW_AT_decl_column : 20
    <e76>   DW_AT_type        : <0xdfc>
 <1><e7a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e7b>   DW_AT_type        : <0xe6e>
 <1><e7f>: Abbrev Number: 6 (DW_TAG_typedef)
    <e80>   DW_AT_name        : (indirect string, offset: 0x86f37): int32_t
    <e84>   DW_AT_decl_file   : 4
    <e85>   DW_AT_decl_line   : 44
    <e86>   DW_AT_decl_column : 19
    <e87>   DW_AT_type        : <0xe0f>
 <1><e8b>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e8c>   DW_AT_type        : <0xe7f>
 <1><e90>: Abbrev Number: 6 (DW_TAG_typedef)
    <e91>   DW_AT_name        : (indirect string, offset: 0x9f44a): uint32_t
    <e95>   DW_AT_decl_file   : 4
    <e96>   DW_AT_decl_line   : 48
    <e97>   DW_AT_decl_column : 20
    <e98>   DW_AT_type        : <0xe22>
 <1><e9c>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e9d>   DW_AT_type        : <0xe90>
 <1><ea1>: Abbrev Number: 8 (DW_TAG_const_type)
    <ea2>   DW_AT_type        : <0xe90>
 <1><ea6>: Abbrev Number: 6 (DW_TAG_typedef)
    <ea7>   DW_AT_name        : (indirect string, offset: 0xdf42c): uint64_t
    <eab>   DW_AT_decl_file   : 4
    <eac>   DW_AT_decl_line   : 60
    <ead>   DW_AT_decl_column : 20
    <eae>   DW_AT_type        : <0xe3c>
 <1><eb2>: Abbrev Number: 10 (DW_TAG_variable)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x4e62): ITM_RxBuffer
    <eb7>   DW_AT_decl_file   : 5
    <eb8>   DW_AT_decl_line   : 2047
    <eba>   DW_AT_decl_column : 25
    <ebb>   DW_AT_type        : <0xe8b>
    <ebf>   DW_AT_external    : 1
    <ebf>   DW_AT_declaration : 1
 <1><ebf>: Abbrev Number: 11 (DW_TAG_variable)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xa4d47): SystemCoreClock
    <ec4>   DW_AT_decl_file   : 6
    <ec5>   DW_AT_decl_line   : 57
    <ec6>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xe90>
    <ecb>   DW_AT_external    : 1
    <ecb>   DW_AT_declaration : 1
 <1><ecb>: Abbrev Number: 12 (DW_TAG_array_type)
    <ecc>   DW_AT_type        : <0xe69>
    <ed0>   DW_AT_sibling     : <0xedb>
 <2><ed4>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ed5>   DW_AT_type        : <0xe56>
    <ed9>   DW_AT_upper_bound : 15
 <2><eda>: Abbrev Number: 0
 <1><edb>: Abbrev Number: 8 (DW_TAG_const_type)
    <edc>   DW_AT_type        : <0xecb>
 <1><ee0>: Abbrev Number: 11 (DW_TAG_variable)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xc74c0): AHBPrescTable
    <ee5>   DW_AT_decl_file   : 6
    <ee6>   DW_AT_decl_line   : 59
    <ee7>   DW_AT_decl_column : 23
    <ee8>   DW_AT_type        : <0xedb>
    <eec>   DW_AT_external    : 1
    <eec>   DW_AT_declaration : 1
 <1><eec>: Abbrev Number: 12 (DW_TAG_array_type)
    <eed>   DW_AT_type        : <0xe69>
    <ef1>   DW_AT_sibling     : <0xefc>
 <2><ef5>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ef6>   DW_AT_type        : <0xe56>
    <efa>   DW_AT_upper_bound : 7
 <2><efb>: Abbrev Number: 0
 <1><efc>: Abbrev Number: 8 (DW_TAG_const_type)
    <efd>   DW_AT_type        : <0xeec>
 <1><f01>: Abbrev Number: 11 (DW_TAG_variable)
    <f02>   DW_AT_name        : (indirect string, offset: 0x8cfd6): APBPrescTable
    <f06>   DW_AT_decl_file   : 6
    <f07>   DW_AT_decl_line   : 60
    <f08>   DW_AT_decl_column : 23
    <f09>   DW_AT_type        : <0xefc>
    <f0d>   DW_AT_external    : 1
    <f0d>   DW_AT_declaration : 1
 <1><f0d>: Abbrev Number: 12 (DW_TAG_array_type)
    <f0e>   DW_AT_type        : <0xea1>
    <f12>   DW_AT_sibling     : <0xf1d>
 <2><f16>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f17>   DW_AT_type        : <0xe56>
    <f1b>   DW_AT_upper_bound : 11
 <2><f1c>: Abbrev Number: 0
 <1><f1d>: Abbrev Number: 8 (DW_TAG_const_type)
    <f1e>   DW_AT_type        : <0xf0d>
 <1><f22>: Abbrev Number: 11 (DW_TAG_variable)
    <f23>   DW_AT_name        : (indirect string, offset: 0x98167): MSIRangeTable
    <f27>   DW_AT_decl_file   : 6
    <f28>   DW_AT_decl_line   : 61
    <f29>   DW_AT_decl_column : 23
    <f2a>   DW_AT_type        : <0xf1d>
    <f2e>   DW_AT_external    : 1
    <f2e>   DW_AT_declaration : 1
 <1><f2e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f2f>   DW_AT_byte_size   : 184
    <f30>   DW_AT_decl_file   : 7
    <f31>   DW_AT_decl_line   : 160
    <f32>   DW_AT_decl_column : 9
    <f33>   DW_AT_sibling     : <0x1117>
 <2><f37>: Abbrev Number: 15 (DW_TAG_member)
    <f38>   DW_AT_name        : ISR
    <f3c>   DW_AT_decl_file   : 7
    <f3d>   DW_AT_decl_line   : 162
    <f3e>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xe9c>
    <f43>   DW_AT_data_member_location: 0
 <2><f44>: Abbrev Number: 15 (DW_TAG_member)
    <f45>   DW_AT_name        : IER
    <f49>   DW_AT_decl_file   : 7
    <f4a>   DW_AT_decl_line   : 163
    <f4b>   DW_AT_decl_column : 17
    <f4c>   DW_AT_type        : <0xe9c>
    <f50>   DW_AT_data_member_location: 4
 <2><f51>: Abbrev Number: 15 (DW_TAG_member)
    <f52>   DW_AT_name        : CR
    <f55>   DW_AT_decl_file   : 7
    <f56>   DW_AT_decl_line   : 164
    <f57>   DW_AT_decl_column : 17
    <f58>   DW_AT_type        : <0xe9c>
    <f5c>   DW_AT_data_member_location: 8
 <2><f5d>: Abbrev Number: 16 (DW_TAG_member)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xdeadb): CFGR
    <f62>   DW_AT_decl_file   : 7
    <f63>   DW_AT_decl_line   : 165
    <f64>   DW_AT_decl_column : 17
    <f65>   DW_AT_type        : <0xe9c>
    <f69>   DW_AT_data_member_location: 12
 <2><f6a>: Abbrev Number: 16 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0xdfe6e): CFGR2
    <f6f>   DW_AT_decl_file   : 7
    <f70>   DW_AT_decl_line   : 166
    <f71>   DW_AT_decl_column : 17
    <f72>   DW_AT_type        : <0xe9c>
    <f76>   DW_AT_data_member_location: 16
 <2><f77>: Abbrev Number: 16 (DW_TAG_member)
    <f78>   DW_AT_name        : (indirect string, offset: 0xb0f3a): SMPR1
    <f7c>   DW_AT_decl_file   : 7
    <f7d>   DW_AT_decl_line   : 167
    <f7e>   DW_AT_decl_column : 17
    <f7f>   DW_AT_type        : <0xe9c>
    <f83>   DW_AT_data_member_location: 20
 <2><f84>: Abbrev Number: 16 (DW_TAG_member)
    <f85>   DW_AT_name        : (indirect string, offset: 0x4d489): SMPR2
    <f89>   DW_AT_decl_file   : 7
    <f8a>   DW_AT_decl_line   : 168
    <f8b>   DW_AT_decl_column : 17
    <f8c>   DW_AT_type        : <0xe9c>
    <f90>   DW_AT_data_member_location: 24
 <2><f91>: Abbrev Number: 16 (DW_TAG_member)
    <f92>   DW_AT_name        : (indirect string, offset: 0xe1bda): RESERVED1
    <f96>   DW_AT_decl_file   : 7
    <f97>   DW_AT_decl_line   : 169
    <f98>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xe90>
    <f9d>   DW_AT_data_member_location: 28
 <2><f9e>: Abbrev Number: 15 (DW_TAG_member)
    <f9f>   DW_AT_name        : TR1
    <fa3>   DW_AT_decl_file   : 7
    <fa4>   DW_AT_decl_line   : 170
    <fa5>   DW_AT_decl_column : 17
    <fa6>   DW_AT_type        : <0xe9c>
    <faa>   DW_AT_data_member_location: 32
 <2><fab>: Abbrev Number: 15 (DW_TAG_member)
    <fac>   DW_AT_name        : TR2
    <fb0>   DW_AT_decl_file   : 7
    <fb1>   DW_AT_decl_line   : 171
    <fb2>   DW_AT_decl_column : 17
    <fb3>   DW_AT_type        : <0xe9c>
    <fb7>   DW_AT_data_member_location: 36
 <2><fb8>: Abbrev Number: 15 (DW_TAG_member)
    <fb9>   DW_AT_name        : TR3
    <fbd>   DW_AT_decl_file   : 7
    <fbe>   DW_AT_decl_line   : 172
    <fbf>   DW_AT_decl_column : 17
    <fc0>   DW_AT_type        : <0xe9c>
    <fc4>   DW_AT_data_member_location: 40
 <2><fc5>: Abbrev Number: 16 (DW_TAG_member)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xe1be4): RESERVED2
    <fca>   DW_AT_decl_file   : 7
    <fcb>   DW_AT_decl_line   : 173
    <fcc>   DW_AT_decl_column : 17
    <fcd>   DW_AT_type        : <0xe90>
    <fd1>   DW_AT_data_member_location: 44
 <2><fd2>: Abbrev Number: 16 (DW_TAG_member)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x98fea): SQR1
    <fd7>   DW_AT_decl_file   : 7
    <fd8>   DW_AT_decl_line   : 174
    <fd9>   DW_AT_decl_column : 17
    <fda>   DW_AT_type        : <0xe9c>
    <fde>   DW_AT_data_member_location: 48
 <2><fdf>: Abbrev Number: 16 (DW_TAG_member)
    <fe0>   DW_AT_name        : (indirect string, offset: 0xdd4aa): SQR2
    <fe4>   DW_AT_decl_file   : 7
    <fe5>   DW_AT_decl_line   : 175
    <fe6>   DW_AT_decl_column : 17
    <fe7>   DW_AT_type        : <0xe9c>
    <feb>   DW_AT_data_member_location: 52
 <2><fec>: Abbrev Number: 16 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0xdd4af): SQR3
    <ff1>   DW_AT_decl_file   : 7
    <ff2>   DW_AT_decl_line   : 176
    <ff3>   DW_AT_decl_column : 17
    <ff4>   DW_AT_type        : <0xe9c>
    <ff8>   DW_AT_data_member_location: 56
 <2><ff9>: Abbrev Number: 16 (DW_TAG_member)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xdd4b4): SQR4
    <ffe>   DW_AT_decl_file   : 7
    <fff>   DW_AT_decl_line   : 177
    <1000>   DW_AT_decl_column : 17
    <1001>   DW_AT_type        : <0xe9c>
    <1005>   DW_AT_data_member_location: 60
 <2><1006>: Abbrev Number: 15 (DW_TAG_member)
    <1007>   DW_AT_name        : DR
    <100a>   DW_AT_decl_file   : 7
    <100b>   DW_AT_decl_line   : 178
    <100c>   DW_AT_decl_column : 17
    <100d>   DW_AT_type        : <0xe9c>
    <1011>   DW_AT_data_member_location: 64
 <2><1012>: Abbrev Number: 16 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0xe1bee): RESERVED3
    <1017>   DW_AT_decl_file   : 7
    <1018>   DW_AT_decl_line   : 179
    <1019>   DW_AT_decl_column : 17
    <101a>   DW_AT_type        : <0xe90>
    <101e>   DW_AT_data_member_location: 68
 <2><101f>: Abbrev Number: 16 (DW_TAG_member)
    <1020>   DW_AT_name        : (indirect string, offset: 0xdff01): RESERVED4
    <1024>   DW_AT_decl_file   : 7
    <1025>   DW_AT_decl_line   : 180
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0xe90>
    <102b>   DW_AT_data_member_location: 72
 <2><102c>: Abbrev Number: 16 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0xa89fd): JSQR
    <1031>   DW_AT_decl_file   : 7
    <1032>   DW_AT_decl_line   : 181
    <1033>   DW_AT_decl_column : 17
    <1034>   DW_AT_type        : <0xe9c>
    <1038>   DW_AT_data_member_location: 76
 <2><1039>: Abbrev Number: 16 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0xe1bf8): RESERVED5
    <103e>   DW_AT_decl_file   : 7
    <103f>   DW_AT_decl_line   : 182
    <1040>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0x1117>
    <1045>   DW_AT_data_member_location: 80
 <2><1046>: Abbrev Number: 16 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0xe041e): OFR1
    <104b>   DW_AT_decl_file   : 7
    <104c>   DW_AT_decl_line   : 183
    <104d>   DW_AT_decl_column : 17
    <104e>   DW_AT_type        : <0xe9c>
    <1052>   DW_AT_data_member_location: 96
 <2><1053>: Abbrev Number: 16 (DW_TAG_member)
    <1054>   DW_AT_name        : (indirect string, offset: 0xe11a3): OFR2
    <1058>   DW_AT_decl_file   : 7
    <1059>   DW_AT_decl_line   : 184
    <105a>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0xe9c>
    <105f>   DW_AT_data_member_location: 100
 <2><1060>: Abbrev Number: 16 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0xe11a8): OFR3
    <1065>   DW_AT_decl_file   : 7
    <1066>   DW_AT_decl_line   : 185
    <1067>   DW_AT_decl_column : 17
    <1068>   DW_AT_type        : <0xe9c>
    <106c>   DW_AT_data_member_location: 104
 <2><106d>: Abbrev Number: 16 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0xe11ad): OFR4
    <1072>   DW_AT_decl_file   : 7
    <1073>   DW_AT_decl_line   : 186
    <1074>   DW_AT_decl_column : 17
    <1075>   DW_AT_type        : <0xe9c>
    <1079>   DW_AT_data_member_location: 108
 <2><107a>: Abbrev Number: 16 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0xdff0b): RESERVED6
    <107f>   DW_AT_decl_file   : 7
    <1080>   DW_AT_decl_line   : 187
    <1081>   DW_AT_decl_column : 17
    <1082>   DW_AT_type        : <0x1117>
    <1086>   DW_AT_data_member_location: 112
 <2><1087>: Abbrev Number: 16 (DW_TAG_member)
    <1088>   DW_AT_name        : (indirect string, offset: 0xe028c): JDR1
    <108c>   DW_AT_decl_file   : 7
    <108d>   DW_AT_decl_line   : 188
    <108e>   DW_AT_decl_column : 17
    <108f>   DW_AT_type        : <0xe9c>
    <1093>   DW_AT_data_member_location: 128
 <2><1094>: Abbrev Number: 16 (DW_TAG_member)
    <1095>   DW_AT_name        : (indirect string, offset: 0xe0291): JDR2
    <1099>   DW_AT_decl_file   : 7
    <109a>   DW_AT_decl_line   : 189
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0xe9c>
    <10a0>   DW_AT_data_member_location: 132
 <2><10a1>: Abbrev Number: 16 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0xe0296): JDR3
    <10a6>   DW_AT_decl_file   : 7
    <10a7>   DW_AT_decl_line   : 190
    <10a8>   DW_AT_decl_column : 17
    <10a9>   DW_AT_type        : <0xe9c>
    <10ad>   DW_AT_data_member_location: 136
 <2><10ae>: Abbrev Number: 16 (DW_TAG_member)
    <10af>   DW_AT_name        : (indirect string, offset: 0xde5c9): JDR4
    <10b3>   DW_AT_decl_file   : 7
    <10b4>   DW_AT_decl_line   : 191
    <10b5>   DW_AT_decl_column : 17
    <10b6>   DW_AT_type        : <0xe9c>
    <10ba>   DW_AT_data_member_location: 140
